{
	"id": "SUSE-SU-2015:1353-1",
	"modified": "2015-07-16T15:50:27Z",
	"published": "2015-07-16T15:50:27Z",
	"related": [
		"CVE-2015-0468",
		"CVE-2015-2599",
		"CVE-2015-2629",
		"CVE-2015-2646",
		"CVE-2015-2647",
		"CVE-2015-4735",
		"CVE-2015-4740",
		"CVE-2015-4753"
	],
	"summary": "Security update for oracle-update",
	"details": "oracle-update was updated to fix eight security issues.\n\nThese security issues were fixed:\n- CVE-2015-2629: Vulnerability in the Java VM component of Oracle Database Server. This vulnerability requires Create Session privileges for a successful attack. Easily exploitable vulnerability allows successful authenticated network attacks via multiple protocols. Successful attack of this vulnerability can result in unauthorized Operating System takeover including arbitrary code execution (bsc#938160).\n- CVE-2015-2599: Vulnerability in the RDBMS Scheduler component of Oracle Database Server. This vulnerability requires Alter Session privileges for a successful attack. Successful attack of this vulnerability can result in unauthorized read access to all RDBMS Scheduler accessible data (bsc#938160).\n- CVE-2015-4735: Vulnerability in the Enterprise Manager for Oracle Database component of Oracle Enterprise Manager Grid Control (subcomponent: RAC Management). Easily exploitable vulnerability allows successful unauthenticated network attacks via HTTP. Successful attack of this vulnerability can result in unauthorized read access to a subset of Enterprise Manager for Oracle Database accessible data (bsc#938160).\n- CVE-2015-4740: Vulnerability in the RDBMS Partitioning component of Oracle Database Server. This vulnerability requires Create Session, Create Any Index, Index object privilege on a Table privileges for a successful attack. Difficult to exploit vulnerability allows successful authenticated network attacks via Oracle Net. Successful attack of this vulnerability can result in unauthorized takeover of RDBMS Partitioning possibly including arbitrary code execution within the RDBMS Partitioning (bsc#938160).\n- CVE-2015-4753: Vulnerability in the RDBMS Support Tools component of Oracle Database Server. Easily exploitable vulnerability requiring logon to Operating System. Successful attack of this vulnerability can result in unauthorized read access to all RDBMS Support Tools accessible data (bsc#938160).\n- CVE-2015-0468: Vulnerability in the Core RDBMS component of Oracle Database Server. This vulnerability requires Analyze Any or Create Materialized View privileges for a successful attack. Difficult to exploit vulnerability allows successful authenticated network attacks via Oracle Net. Successful attack of this vulnerability can result in unauthorized takeover of Core RDBMS possibly including arbitrary code execution within the Core RDBMS (bsc#938160).\n- CVE-2015-2647: Vulnerability in the Enterprise Manager for Oracle Database component of Oracle Enterprise Manager Grid Control (subcomponent: Content Management). Easily exploitable vulnerability allows successful authenticated network attacks via HTTP. Successful attack of this vulnerability can result in unauthorized update, insert or delete access to all Enterprise Manager for Oracle Database accessible data as well as read access to all Enterprise Manager for Oracle Database accessible data (bsc#938160).\n- CVE-2015-2646: Vulnerability in the Enterprise Manager for Oracle Database component of Oracle Enterprise Manager Grid Control (subcomponent: Content Management). Difficult to exploit vulnerability allows successful unauthenticated network attacks via HTTP. Successful attack of this vulnerability can result in unauthorized update, insert or delete access to some Enterprise Manager for Oracle Database accessible data (bsc#938160).\n\nFor more details please see\nhttp://www.oracle.com/technetwork/topics/security/cpujul2015verbose-2367947.html\n  ",
	"affected": [
		{
			"package": {
				"ecosystem": "SUSE:Manager 2.1",
				"name": "oracle-update",
				"purl": "purl:rpm/suse/oracle-update&distro=SUSE%20Manager%202.1"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "1.7-0.34.1"
						}
					]
				}
			],
			"ecosystem_specific": {
				"binaries": [
					{
						"oracle-update": "1.7-0.34.1"
					}
				]
			}
		}
	],
	"references": [
		{
			"type": "ADVISORY",
			"url": "https://www.suse.com/support/update/announcement/2015/suse-su-20151353-1/"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/938160"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2015-0468"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2015-2599"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2015-2629"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2015-2646"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2015-2647"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2015-4735"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2015-4740"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2015-4753"
		}
	]
}
