{
	"id": "SUSE-SU-2015:1319-1",
	"modified": "2015-07-23T00:21:00Z",
	"published": "2015-07-23T00:21:00Z",
	"related": [
		"CVE-2015-2590",
		"CVE-2015-2596",
		"CVE-2015-2597",
		"CVE-2015-2601",
		"CVE-2015-2613",
		"CVE-2015-2619",
		"CVE-2015-2621",
		"CVE-2015-2625",
		"CVE-2015-2627",
		"CVE-2015-2628",
		"CVE-2015-2632",
		"CVE-2015-2637",
		"CVE-2015-2638",
		"CVE-2015-2664",
		"CVE-2015-2808",
		"CVE-2015-4000",
		"CVE-2015-4729",
		"CVE-2015-4731",
		"CVE-2015-4732",
		"CVE-2015-4733",
		"CVE-2015-4736",
		"CVE-2015-4748",
		"CVE-2015-4749",
		"CVE-2015-4760"
	],
	"summary": "Security update for java-1_7_0-openjdk",
	"details": "OpenJDK was updated to 2.6.1 - OpenJDK 7u85 to fix security issues and bugs.\n\nThe following vulnerabilities were fixed:\n\n* CVE-2015-2590: Easily exploitable vulnerability in the Libraries component allowed successful unauthenticated network attacks via multiple protocols. Successful attack of this vulnerability could have resulted in unauthorized Operating System takeover including arbitrary code execution.\n* CVE-2015-2596: Difficult to exploit vulnerability in the Hotspot component allowed successful unauthenticated network attacks via multiple protocols. Successful attack of this vulnerability could have resulted in unauthorized update, insert or delete access to some Java accessible data.\n* CVE-2015-2597: Easily exploitable vulnerability in the Install component requiring logon to Operating System. Successful attack of this vulnerability could have resulted in unauthorized Operating System takeover including arbitrary code execution.\n* CVE-2015-2601: Easily exploitable vulnerability in the JCE component allowed successful unauthenticated network attacks via multiple protocols. Successful attack of this vulnerability could have resulted in unauthorized read access to a subset of Java accessible data.\n* CVE-2015-2613: Easily exploitable vulnerability in the JCE component allowed successful unauthenticated network attacks via multiple protocols. Successful attack of this vulnerability could have resulted in unauthorized read access to a subset of Java SE, Java SE Embedded accessible data.\n* CVE-2015-2619: Easily exploitable vulnerability in the 2D component allowed successful unauthenticated network attacks via multiple protocols. Successful attack of this vulnerability could have resulted in unauthorized read access to a subset of Java accessible data.\n* CVE-2015-2621: Easily exploitable vulnerability in the JMX component allowed successful unauthenticated network attacks via multiple protocols. Successful attack of this vulnerability could have resulted in unauthorized read access to a subset of Java accessible data.\n* CVE-2015-2625: Very difficult to exploit vulnerability in the JSSE component allowed successful unauthenticated network attacks via SSL/TLS. Successful attack of this vulnerability could have resulted in unauthorized read access to a subset of Java accessible data.\n* CVE-2015-2627: Very difficult to exploit vulnerability in the Install component allowed successful unauthenticated network attacks via multiple protocols. Successful attack of this vulnerability could have resulted in unauthorized read access to a subset of Java accessible data.\n* CVE-2015-2628: Easily exploitable vulnerability in the CORBA component allowed successful unauthenticated network attacks via multiple protocols. Successful attack of this vulnerability could have resulted in unauthorized Operating System takeover including arbitrary code execution.\n* CVE-2015-2632: Easily exploitable vulnerability in the 2D component allowed successful unauthenticated network attacks via multiple protocols. Successful attack of this vulnerability could have resulted in unauthorized read access to a subset of Java accessible data.\n* CVE-2015-2637: Easily exploitable vulnerability in the 2D component allowed successful unauthenticated network attacks via multiple protocols. Successful attack of this vulnerability could have resulted in unauthorized read access to a subset of Java accessible data.\n* CVE-2015-2638: Easily exploitable vulnerability in the 2D component allowed successful unauthenticated network attacks via multiple protocols. Successful attack of this vulnerability could have resulted in unauthorized Operating System takeover including arbitrary code execution.\n* CVE-2015-2664: Difficult to exploit vulnerability in the Deployment component requiring logon to Operating System. Successful attack of this vulnerability could have resulted in unauthorized Operating System takeover including arbitrary code execution.\n* CVE-2015-2808: Very difficult to exploit vulnerability in the JSSE component allowed successful unauthenticated network attacks via SSL/TLS. Successful attack of this vulnerability could have resulted in unauthorized update, insert or delete access to some Java accessible data as well as read access to a subset of Java accessible data.\n* CVE-2015-4000: Very difficult to exploit vulnerability in the JSSE component allowed successful unauthenticated network attacks via SSL/TLS. Successful attack of this vulnerability could have resulted in unauthorized update, insert or delete access to some Java accessible data as well as read access to a subset of Java Embedded accessible data. \n* CVE-2015-4729: Very difficult to exploit vulnerability in the Deployment component allowed successful unauthenticated network attacks via multiple protocols. Successful attack of this vulnerability could have resulted in unauthorized update, insert or delete access to some Java SE accessible data as well as read access to a subset of Java SE accessible data.\n* CVE-2015-4731: Easily exploitable vulnerability in the JMX component allowed successful unauthenticated network attacks via multiple protocols. Successful attack of this vulnerability could have resulted in unauthorized Operating System takeover including arbitrary code execution.\n* CVE-2015-4732: Easily exploitable vulnerability in the Libraries component allowed successful unauthenticated network attacks via multiple protocols. Successful attack of this vulnerability could have resulted in unauthorized Operating System takeover including arbitrary code execution.\n* CVE-2015-4733: Easily exploitable vulnerability in the RMI component allowed successful unauthenticated network attacks via multiple protocols. Successful attack of this vulnerability could have resulted in unauthorized Operating System takeover including arbitrary code execution.\n* CVE-2015-4736: Difficult to exploit vulnerability in the Deployment component allowed successful unauthenticated network attacks via multiple protocols. Successful attack of this vulnerability could have resulted in unauthorized Operating System takeover including arbitrary code execution.\n* CVE-2015-4748: Very difficult to exploit vulnerability in the Security component allowed successful unauthenticated network attacks via OCSP. Successful attack of this vulnerability could have resulted in unauthorized Operating System takeover including arbitrary code execution.\n* CVE-2015-4749: Difficult to exploit vulnerability in the JNDI component allowed successful unauthenticated network attacks via multiple protocols. Successful attack of this vulnerability could have resulted in unauthorized ability to cause a partial denial of service (partial DOS).\n* CVE-2015-4760: Easily exploitable vulnerability in the 2D component allowed successful unauthenticated network attacks via multiple protocols. Successful attack of this vulnerability could have resulted in unauthorized Operating System takeover including arbitrary code execution.",
	"affected": [
		{
			"package": {
				"ecosystem": "SUSE:Linux Enterprise Desktop 12",
				"name": "java-1_7_0-openjdk",
				"purl": "purl:rpm/suse/java-1_7_0-openjdk&distro=SUSE%20Linux%20Enterprise%20Desktop%2012"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "1.7.0.85-18.2"
						}
					]
				}
			],
			"ecosystem_specific": {
				"binaries": [
					{
						"java-1_7_0-openjdk": "1.7.0.85-18.2",
						"java-1_7_0-openjdk-headless": "1.7.0.85-18.2"
					}
				]
			}
		},
		{
			"package": {
				"ecosystem": "SUSE:Linux Enterprise Server 12",
				"name": "java-1_7_0-openjdk",
				"purl": "purl:rpm/suse/java-1_7_0-openjdk&distro=SUSE%20Linux%20Enterprise%20Server%2012"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "1.7.0.85-18.2"
						}
					]
				}
			],
			"ecosystem_specific": {
				"binaries": [
					{
						"java-1_7_0-openjdk": "1.7.0.85-18.2",
						"java-1_7_0-openjdk-demo": "1.7.0.85-18.2",
						"java-1_7_0-openjdk-devel": "1.7.0.85-18.2",
						"java-1_7_0-openjdk-headless": "1.7.0.85-18.2"
					}
				]
			}
		},
		{
			"package": {
				"ecosystem": "SUSE:Linux Enterprise Server for SAP Applications 12",
				"name": "java-1_7_0-openjdk",
				"purl": "purl:rpm/suse/java-1_7_0-openjdk&distro=SUSE%20Linux%20Enterprise%20Server%20for%20SAP%20Applications%2012"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "1.7.0.85-18.2"
						}
					]
				}
			],
			"ecosystem_specific": {
				"binaries": [
					{
						"java-1_7_0-openjdk": "1.7.0.85-18.2",
						"java-1_7_0-openjdk-demo": "1.7.0.85-18.2",
						"java-1_7_0-openjdk-devel": "1.7.0.85-18.2",
						"java-1_7_0-openjdk-headless": "1.7.0.85-18.2"
					}
				]
			}
		}
	],
	"references": [
		{
			"type": "ADVISORY",
			"url": "https://www.suse.com/support/update/announcement/2015/suse-su-20151319-1/"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/938248"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2015-2590"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2015-2596"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2015-2597"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2015-2601"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2015-2613"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2015-2619"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2015-2621"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2015-2625"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2015-2627"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2015-2628"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2015-2632"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2015-2637"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2015-2638"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2015-2664"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2015-2808"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2015-4000"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2015-4729"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2015-4731"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2015-4732"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2015-4733"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2015-4736"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2015-4748"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2015-4749"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2015-4760"
		}
	]
}
