{
	"id": "SUSE-SU-2018:1333-1",
	"modified": "2018-05-18T06:04:21Z",
	"published": "2018-05-18T06:04:21Z",
	"related": [
		"CVE-2018-2755",
		"CVE-2018-2761",
		"CVE-2018-2771",
		"CVE-2018-2773",
		"CVE-2018-2781",
		"CVE-2018-2813",
		"CVE-2018-2817",
		"CVE-2018-2818",
		"CVE-2018-2819"
	],
	"summary": "security update for mysql",
	"details": "\n  This update fixes the following issues:\n\n  - Update to 5.5.60 in Oracle Apr2018 CPU (bsc#1089987).\n  - CVE-2018-2761: Vulnerability in the MySQL Server component of Oracle MySQL (subcomponent: Client programs). Supported versions that are affected are 5.5.59 and prior, 5.6.39 and prior and 5.7.21 and prior. Difficult to exploit vulnerability allows unauthenticated attacker with network access via multiple protocols to compromise MySQL Server. Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of MySQL Server. CVSS 3.0 Base Score 5.9 (Availability impacts). CVSS Vector: (CVSS:3.0/AV:N/AC:H/PR:N/UI:N/S:U/C:N/I:N/A:H).\n  - CVE-2018-2755: Vulnerability in the MySQL Server component of Oracle MySQL (subcomponent: Server: Replication). Supported versions that are affected are 5.5.59 and prior, 5.6.39 and prior and 5.7.21 and prior. Difficult to exploit vulnerability allows unauthenticated attacker with logon to the infrastructure where MySQL Server executes to compromise MySQL Server. Successful attacks require human interaction from a person other than the attacker and while the vulnerability is in MySQL Server, attacks may significantly impact additional products. Successful attacks of this vulnerability can result in takeover of MySQL Server. CVSS 3.0 Base Score 7.7 (Confidentiality, Integrity and Availability impacts). CVSS Vector: (CVSS:3.0/AV:L/AC:H/PR:N/UI:R/S:C/C:H/I:H/A:H).\n  - CVE-2018-2781: Vulnerability in the MySQL Server component of Oracle MySQL (subcomponent: Server: Optimizer). Supported versions that are affected are 5.5.59 and prior, 5.6.39 and prior and 5.7.21 and prior. Easily exploitable vulnerability allows high privileged attacker with network access via multiple protocols to compromise MySQL Server. Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of MySQL Server. CVSS 3.0 Base Score 4.9 (Availability impacts). CVSS Vector: (CVSS:3.0/AV:N/AC:L/PR:H/UI:N/S:U/C:N/I:N/A:H).\n  - CVE-2018-2819: Vulnerability in the MySQL Server component of Oracle MySQL (subcomponent: InnoDB). Supported versions that are affected are 5.5.59 and prior, 5.6.39 and prior and 5.7.21 and prior. Easily exploitable vulnerability allows low privileged attacker with network access via multiple protocols to compromise MySQL Server. Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of MySQL Server. CVSS 3.0 Base Score 6.5 (Availability impacts). CVSS Vector: (CVSS:3.0/AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H).\n  - CVE-2018-2818: Vulnerability in the MySQL Server component of Oracle MySQL (subcomponent: Server : Security : Privileges). Supported versions that are affected are 5.5.59 and prior, 5.6.39 and prior and 5.7.21 and prior. Easily exploitable vulnerability allows high privileged attacker with network access via multiple protocols to compromise MySQL Server. Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of MySQL Server. CVSS 3.0 Base Score 4.9 (Availability impacts). CVSS Vector: (CVSS:3.0/AV:N/AC:L/PR:H/UI:N/S:U/C:N/I:N/A:H).\n  - CVE-2018-2817: Vulnerability in the MySQL Server component of Oracle MySQL (subcomponent: Server: DDL). Supported versions that are affected are 5.5.59 and prior, 5.6.39 and prior and 5.7.21 and prior. Easily exploitable vulnerability allows low privileged attacker with network access via multiple protocols to compromise MySQL Server. Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of MySQL Server. CVSS 3.0 Base Score 6.5 (Availability impacts). CVSS Vector: (CVSS:3.0/AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H).\n  - CVE-2018-2771: Vulnerability in the MySQL Server component of Oracle MySQL (subcomponent: Server: Locking). Supported versions that are affected are 5.5.59 and prior, 5.6.39 and prior and 5.7.21 and prior. Difficult to exploit vulnerability allows high privileged attacker with network access via multiple protocols to compromise MySQL Server. Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of MySQL Server. CVSS 3.0 Base Score 4.4 (Availability impacts). CVSS Vector: (CVSS:3.0/AV:N/AC:H/PR:H/UI:N/S:U/C:N/I:N/A:H).\n  - CVE-2018-2813: Vulnerability in the MySQL Server component of Oracle MySQL (subcomponent: Server: DDL). Supported versions that are affected are 5.5.59 and prior, 5.6.39 and prior and 5.7.21 and prior. Easily exploitable vulnerability allows low privileged attacker with network access via multiple protocols to compromise MySQL Server. Successful attacks of this vulnerability can result in unauthorized read access to a subset of MySQL Server accessible data. CVSS 3.0 Base Score 4.3 (Confidentiality impacts). CVSS Vector: (CVSS:3.0/AV:N/AC:L/PR:L/UI:N/S:U/C:L/I:N/A:N).\n  - CVE-2018-2773: Vulnerability in the MySQL Server component of Oracle MySQL (subcomponent: Client programs). Supported versions that are affected are 5.5.59 and prior, 5.6.39 and prior and 5.7.21 and prior. Difficult to exploit vulnerability allows high privileged attacker with logon to the infrastructure where MySQL Server executes to compromise MySQL Server. Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of MySQL Server. CVSS 3.0 Base Score 4.1 (Availability impacts). CVSS Vector: (CVSS:3.0/AV:L/AC:H/PR:H/UI:N/S:U/C:N/I:N/A:H).\n  ",
	"affected": [
		{
			"package": {
				"ecosystem": "SUSE:Linux Enterprise Software Development Kit 11 SP4",
				"name": "mysql",
				"purl": "pkg:rpm/suse/mysql&distro=SUSE%20Linux%20Enterprise%20Software%20Development%20Kit%2011%20SP4"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "5.5.60-0.39.12.1"
						}
					]
				}
			],
			"ecosystem_specific": {
				"binaries": [
					{
						"libmysql55client_r18-32bit": "5.5.60-0.39.12.1",
						"libmysql55client_r18-x86": "5.5.60-0.39.12.1"
					}
				]
			}
		},
		{
			"package": {
				"ecosystem": "SUSE:Linux Enterprise Server 11 SP4",
				"name": "mysql",
				"purl": "pkg:rpm/suse/mysql&distro=SUSE%20Linux%20Enterprise%20Server%2011%20SP4"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "5.5.60-0.39.12.1"
						}
					]
				}
			],
			"ecosystem_specific": {
				"binaries": [
					{
						"libmysql55client18": "5.5.60-0.39.12.1",
						"libmysql55client18-32bit": "5.5.60-0.39.12.1",
						"libmysql55client18-x86": "5.5.60-0.39.12.1",
						"libmysql55client_r18": "5.5.60-0.39.12.1",
						"libmysql55client_r18-32bit": "5.5.60-0.39.12.1",
						"libmysql55client_r18-x86": "5.5.60-0.39.12.1",
						"mysql": "5.5.60-0.39.12.1",
						"mysql-client": "5.5.60-0.39.12.1",
						"mysql-tools": "5.5.60-0.39.12.1"
					}
				]
			}
		},
		{
			"package": {
				"ecosystem": "SUSE:Linux Enterprise Server for SAP Applications 11 SP4",
				"name": "mysql",
				"purl": "pkg:rpm/suse/mysql&distro=SUSE%20Linux%20Enterprise%20Server%20for%20SAP%20Applications%2011%20SP4"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "5.5.60-0.39.12.1"
						}
					]
				}
			],
			"ecosystem_specific": {
				"binaries": [
					{
						"libmysql55client18": "5.5.60-0.39.12.1",
						"libmysql55client18-32bit": "5.5.60-0.39.12.1",
						"libmysql55client18-x86": "5.5.60-0.39.12.1",
						"libmysql55client_r18": "5.5.60-0.39.12.1",
						"libmysql55client_r18-32bit": "5.5.60-0.39.12.1",
						"libmysql55client_r18-x86": "5.5.60-0.39.12.1",
						"mysql": "5.5.60-0.39.12.1",
						"mysql-client": "5.5.60-0.39.12.1",
						"mysql-tools": "5.5.60-0.39.12.1"
					}
				]
			}
		}
	],
	"references": [
		{
			"type": "ADVISORY",
			"url": "https://www.suse.com/support/update/announcement/2018/suse-su-20181333-1/"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1089987"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2018-2755"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2018-2761"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2018-2771"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2018-2773"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2018-2781"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2018-2813"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2018-2817"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2018-2818"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2018-2819"
		}
	]
}
