{
	"id": "SUSE-SU-2018:3207-1",
	"modified": "2018-10-17T14:57:07Z",
	"published": "2018-10-17T14:57:07Z",
	"related": [
		"CVE-2014-9939",
		"CVE-2017-15938",
		"CVE-2017-15939",
		"CVE-2017-15996",
		"CVE-2017-16826",
		"CVE-2017-16827",
		"CVE-2017-16828",
		"CVE-2017-16829",
		"CVE-2017-16830",
		"CVE-2017-16831",
		"CVE-2017-16832",
		"CVE-2017-6965",
		"CVE-2017-6966",
		"CVE-2017-6969",
		"CVE-2017-7209",
		"CVE-2017-7210",
		"CVE-2017-7223",
		"CVE-2017-7224",
		"CVE-2017-7225",
		"CVE-2017-7226",
		"CVE-2017-7299",
		"CVE-2017-7300",
		"CVE-2017-7301",
		"CVE-2017-7302",
		"CVE-2017-7303",
		"CVE-2017-7304",
		"CVE-2017-8392",
		"CVE-2017-8393",
		"CVE-2017-8394",
		"CVE-2017-8396",
		"CVE-2017-8421",
		"CVE-2017-9746",
		"CVE-2017-9747",
		"CVE-2017-9748",
		"CVE-2017-9750",
		"CVE-2017-9755",
		"CVE-2017-9756",
		"CVE-2018-10372",
		"CVE-2018-10373",
		"CVE-2018-10534",
		"CVE-2018-10535",
		"CVE-2018-6323",
		"CVE-2018-6543",
		"CVE-2018-6759",
		"CVE-2018-6872",
		"CVE-2018-7208",
		"CVE-2018-7568",
		"CVE-2018-7569",
		"CVE-2018-7570",
		"CVE-2018-7642",
		"CVE-2018-7643",
		"CVE-2018-8945"
	],
	"summary": "Security update for binutils",
	"details": "This update for binutils to 2.31 fixes the following issues:\n\nThese security issues were fixed:\n\n- CVE-2017-15996: readelf allowed remote attackers to cause a denial of service\n  (excessive memory allocation) or possibly have unspecified other impact via a\n  crafted ELF file that triggered a buffer overflow on fuzzed archive header\n  (bsc#1065643).\n- CVE-2017-15939: Binary File Descriptor (BFD) library (aka libbfd) mishandled\n  NULL files in a .debug_line file table, which allowed remote attackers to cause\n  a denial of service (NULL pointer dereference and application crash) via a\n  crafted ELF file, related to concat_filename (bsc#1065689).\n- CVE-2017-15938: the Binary File Descriptor (BFD) library (aka libbfd)\n  miscalculated DW_FORM_ref_addr die refs in the case of a relocatable object\n  file, which allowed remote attackers to cause a denial of service\n  (find_abstract_instance_name invalid memory read, segmentation fault, and\n  application crash) (bsc#1065693).\n- CVE-2017-16826: The coff_slurp_line_table function the Binary File Descriptor\n  (BFD) library (aka libbfd) allowed remote attackers to cause a denial of\n  service (invalid memory access and application crash) or possibly have\n  unspecified other impact via a crafted PE file (bsc#1068640).\n- CVE-2017-16832: The pe_bfd_read_buildid function in the Binary File\n  Descriptor (BFD) library (aka libbfd) did not validate size and offset values\n  in the data dictionary, which allowed remote attackers to cause a denial of\n  service (segmentation violation and application crash) or possibly have\n  unspecified other impact via a crafted PE file (bsc#1068643).\n- CVE-2017-16831: Binary File Descriptor (BFD) library (aka libbfd) did not\n  validate the symbol count, which allowed remote attackers to cause a denial of\n  service (integer overflow and application crash, or excessive memory\n  allocation) or possibly have unspecified other impact via a crafted PE file\n  (bsc#1068887).\n- CVE-2017-16830: The print_gnu_property_note function did not have\n  integer-overflow protection on 32-bit platforms, which allowed remote attackers\n  to cause a denial of service (segmentation violation and application crash) or\n  possibly have unspecified other impact via a crafted ELF file (bsc#1068888).\n- CVE-2017-16829: The _bfd_elf_parse_gnu_properties function in the Binary File\n  Descriptor (BFD) library (aka libbfd) did not prevent negative pointers, which\n  allowed remote attackers to cause a denial of service (out-of-bounds read and\n  application crash) or possibly have unspecified other impact via a crafted ELF\n  file (bsc#1068950).\n- CVE-2017-16828: The display_debug_frames function allowed remote attackers to\n  cause a denial of service (integer overflow and heap-based buffer over-read,\n  and application crash) or possibly have unspecified other impact via a crafted\n  ELF file (bsc#1069176).\n- CVE-2017-16827: The aout_get_external_symbols function in the Binary File\n  Descriptor (BFD) library (aka libbfd) allowed remote attackers to cause a\n  denial of service (slurp_symtab invalid free and application crash) or possibly\n  have unspecified other impact via a crafted ELF file (bsc#1069202).\n- CVE-2018-6323: The elf_object_p function in the Binary File Descriptor (BFD)\n  library (aka libbfd) had an unsigned integer overflow because bfd_size_type\n  multiplication is not used. A crafted ELF file allowed remote attackers to\n  cause a denial of service (application crash) or possibly have unspecified\n  other impact (bsc#1077745).\n- CVE-2018-6543: Prevent integer overflow in the function\n  load_specific_debug_section() which resulted in `malloc()` with 0 size. A\n  crafted ELF file allowed remote attackers to cause a denial of service\n  (application crash) or possibly have unspecified other impact (bsc#1079103).\n- CVE-2018-6759: The bfd_get_debug_link_info_1 function in the Binary File\n  Descriptor (BFD) library (aka libbfd) had an unchecked strnlen operation.\n  Remote attackers could have leveraged this vulnerability to cause a denial of\n  service (segmentation fault) via a crafted ELF file (bsc#1079741).\n- CVE-2018-6872: The elf_parse_notes function in the Binary File Descriptor\n  (BFD) library (aka libbfd) allowed remote attackers to cause a denial of\n  service (out-of-bounds read and segmentation violation) via a note with a large\n  alignment (bsc#1080556).\n- CVE-2018-7208: In the coff_pointerize_aux function in the Binary File\n  Descriptor (BFD) library (aka libbfd) an index was not validated, which allowed\n  remote attackers to cause a denial of service (segmentation fault) or possibly\n  have unspecified other impact via a crafted file, as demonstrated by objcopy of\n  a COFF object (bsc#1081527).\n- CVE-2018-7570: The assign_file_positions_for_non_load_sections function in\n  the Binary File Descriptor (BFD) library (aka libbfd) allowed remote attackers\n  to cause a denial of service (NULL pointer dereference and application crash)\n  via an ELF file with a RELRO segment that lacks a matching LOAD segment, as\n  demonstrated by objcopy (bsc#1083528).\n- CVE-2018-7569: The Binary File Descriptor (BFD) library (aka libbfd) allowed\n  remote attackers to cause a denial of service (integer underflow or overflow,\n  and application crash) via an ELF file with a corrupt DWARF FORM block, as\n  demonstrated by nm (bsc#1083532).\n- CVE-2018-8945: The bfd_section_from_shdr function in the Binary File\n  Descriptor (BFD) library (aka libbfd) allowed remote attackers to cause a\n  denial of service (segmentation fault) via a large attribute section\n  (bsc#1086608).\n- CVE-2018-7643: The display_debug_ranges function allowed remote attackers to\n  cause a denial of service (integer overflow and application crash) or possibly\n  have unspecified other impact via a crafted ELF file, as demonstrated by\n  objdump (bsc#1086784).\n- CVE-2018-7642: The swap_std_reloc_in function in the Binary File Descriptor\n  (BFD) library (aka libbfd) allowed remote attackers to cause a denial of\n  service (aout_32_swap_std_reloc_out NULL pointer dereference and application\n  crash) via a crafted ELF file, as demonstrated by objcopy (bsc#1086786).\n- CVE-2018-7568: The parse_die function in the Binary File Descriptor (BFD)\n  library (aka libbfd) allowed remote attackers to cause a denial of service\n  (integer overflow and application crash) via an ELF file with corrupt dwarf1\n  debug information, as demonstrated by nm (bsc#1086788).\n- CVE-2018-10373: concat_filename in the Binary File Descriptor (BFD) library\n  (aka libbfd) allowed remote attackers to cause a denial of service (NULL\n  pointer dereference and application crash) via a crafted binary file, as\n  demonstrated by nm-new (bsc#1090997).\n- CVE-2018-10372: process_cu_tu_index allowed remote attackers to cause a\n  denial of service (heap-based buffer over-read and application crash) via a\n  crafted binary file, as demonstrated by readelf (bsc#1091015).\n- CVE-2018-10535: The ignore_section_sym function in the Binary File Descriptor\n  (BFD) library (aka libbfd) did not validate the output_section pointer in the\n  case of a symtab entry with a 'SECTION' type that has a '0' value, which\n  allowed remote attackers to cause a denial of service (NULL pointer dereference\n  and application crash) via a crafted file, as demonstrated by objcopy\n  (bsc#1091365).\n- CVE-2018-10534: The _bfd_XX_bfd_copy_private_bfd_data_common function in the\n  Binary File Descriptor (BFD) library (aka libbfd) processesed a negative Data\n  Directory size with an unbounded loop that increased the value of\n  (external_IMAGE_DEBUG_DIRECTORY) *edd so that the address exceeded its own\n  memory region, resulting in an out-of-bounds memory write, as demonstrated by\n  objcopy copying private info with _bfd_pex64_bfd_copy_private_bfd_data_common\n  in pex64igen.c (bsc#1091368).\n\nThese non-security issues were fixed:\n\n- The AArch64 port now supports showing disassembly notes which are emitted\n  when inconsistencies are found with the instruction that may result in the\n  instruction being invalid. These can be turned on with the option -M notes\n  to objdump.\n- The AArch64 port now emits warnings when a combination of an instruction and\n  a named register could be invalid.\n- Added O modifier to ar to display member offsets inside an archive\n- The ADR and ADRL pseudo-instructions supported by the ARM assembler\n  now only set the bottom bit of the address of thumb function symbols\n  if the -mthumb-interwork command line option is active.\n- Add --generate-missing-build-notes=[yes|no] option to create (or not) GNU\n  Build Attribute notes if none are present in the input sources.  Add a\n  --enable-generate-build-notes=[yes|no] configure time option to set the\n  default behaviour.  Set the default if the configure option is not used\n  to 'no'.\n- Remove -mold-gcc command-line option for x86 targets.\n- Add -O[2|s] command-line options to x86 assembler to enable alternate\n  shorter instruction encoding.\n- Add support for .nops directive.  It is currently supported only for\n  x86 targets.\n- Speed up direct linking with DLLs for Cygwin and Mingw targets.\n- Add a configure option --enable-separate-code to decide whether\n  -z separate-code should be enabled in ELF linker by default.  Default\n  to yes for Linux/x86 targets. Note that -z separate-code can increase\n  disk and memory size.\n- RISC-V: Fix symbol address problem with versioned symbols \n- Restore riscv64-elf cross prefix via symlinks\n- RISC-V: Don't enable relaxation in relocatable link\n- Prevent linking faiures on i386 with assertion (bsc#1085784)\n- Fix symbol size bug when relaxation deletes bytes\n- Add --debug-dump=links option to readelf and --dwarf=links option to objdump\n  which displays the contents of any .gnu_debuglink or .gnu_debugaltlink\n  sections.\n  Add a --debug-dump=follow-links option to readelf and a --dwarf=follow-links\n  option to objdump which causes indirect links into separate debug info files\n  to be followed when dumping other DWARF sections.\n- Add support for loaction views in DWARF debug line information.\n- Add -z separate-code to generate separate code PT_LOAD segment.\n- Add '-z undefs' command line option as the inverse of the '-z defs' option.\n- Add -z globalaudit command line option to force audit libraries to be run\n  for every dynamic object loaded by an executable - provided that the loader\n  supports this functionality.\n- Tighten linker script grammar around file name specifiers to prevent the use\n  of SORT_BY_ALIGNMENT and SORT_BY_INIT_PRIORITY on filenames.  These would\n  previously be accepted but had no effect.\n- The EXCLUDE_FILE directive can now be placed within any SORT_* directive\n  within input section lists.\n- Fix linker relaxation with --wrap\n- Add arm-none-eabi symlinks (bsc#1074741)\n\nFormer updates of binutils also fixed the following security issues, for which\nthere was not CVE assigned at the time the update was released or no mapping\nbetween code change and CVE existed:\n\n- CVE-2014-9939: Prevent stack buffer overflow when printing bad bytes in Intel\n  Hex objects (bsc#1030296).\n- CVE-2017-7225: The find_nearest_line function in addr2line did not handle the\n  case where the main file name and the directory name are both empty, triggering\n  a NULL pointer dereference and an invalid write, and leading to a program crash\n  (bsc#1030585).\n- CVE-2017-7224: The find_nearest_line function in objdump was vulnerable to an\n  invalid write (of size 1) while disassembling a corrupt binary that contains an\n  empty function name, leading to a program crash (bsc#1030588).\n- CVE-2017-7223: GNU assembler in was vulnerable to a global buffer overflow\n  (of size 1) while attempting to unget an EOF character from the input stream,\n  potentially leading to a program crash (bsc#1030589).\n- CVE-2017-7226: The pe_ILF_object_p function in the Binary File Descriptor\n  (BFD) library (aka libbfd) was vulnerable to a heap-based buffer over-read of\n  size 4049 because it used the strlen function instead of strnlen, leading to\n  program crashes in several utilities such as addr2line, size, and strings. It\n  could lead to information disclosure as well (bsc#1030584).\n- CVE-2017-7299: The Binary File Descriptor (BFD) library (aka libbfd) had an\n  invalid read (of size 8) because the code to emit relocs (bfd_elf_final_link\n  function in bfd/elflink.c) did not check the format of the input file trying to\n  read the ELF reloc section header. The vulnerability leads to a GNU linker (ld)\n  program crash (bsc#1031644).\n- CVE-2017-7300: The Binary File Descriptor (BFD) library (aka libbfd) had an\n  aout_link_add_symbols function in bfd/aoutx.h that is vulnerable to a\n  heap-based buffer over-read (off-by-one) because of an incomplete check for\n  invalid string offsets while loading symbols, leading to a GNU linker (ld)\n  program crash (bsc#1031656).\n- CVE-2017-7302: The Binary File Descriptor (BFD) library (aka libbfd) had a\n  swap_std_reloc_out function in bfd/aoutx.h that is vulnerable to an invalid\n  read (of size 4) because of missing checks for relocs that could not be\n  recognised. This vulnerability caused Binutils utilities like strip to crash\n  (bsc#1031595).\n- CVE-2017-7303: The Binary File Descriptor (BFD) library (aka libbfd) was\n  vulnerable to an invalid read (of size 4) because of missing a check (in the\n  find_link function) for null headers attempting to match them. This\n  vulnerability caused Binutils utilities like strip to crash (bsc#1031593).\n- CVE-2017-7301: The Binary File Descriptor (BFD) library (aka libbfd) had an\n  aout_link_add_symbols function in bfd/aoutx.h that has an off-by-one\n  vulnerability because it did not carefully check the string offset. The\n  vulnerability could lead to a GNU linker (ld) program crash (bsc#1031638).\n- CVE-2017-7304: The Binary File Descriptor (BFD) library (aka libbfd) was\n  vulnerable to an invalid read (of size 8) because of missing a check (in the\n  copy_special_section_fields function) for an invalid sh_link field attempting\n  to follow it. This vulnerability caused Binutils utilities like strip to crash\n  (bsc#1031590).\n- CVE-2017-8392: The Binary File Descriptor (BFD) library (aka libbfd) was\n  vulnerable to an invalid read of size 8 because of missing a check to determine\n  whether symbols are NULL in the _bfd_dwarf2_find_nearest_line function. This\n  vulnerability caused programs that conduct an analysis of binary programs using\n  the libbfd library, such as objdump, to crash (bsc#1037052).\n- CVE-2017-8393: The Binary File Descriptor (BFD) library (aka libbfd) was\n  vulnerable to a global buffer over-read error because of an assumption made by\n  code that runs for objcopy and strip, that SHT_REL/SHR_RELA sections are always\n  named starting with a .rel/.rela prefix. This vulnerability caused programs\n  that conduct an analysis of binary programs using the libbfd library, such as\n  objcopy and strip, to crash (bsc#1037057).\n- CVE-2017-8394: The Binary File Descriptor (BFD) library (aka libbfd) was\n  vulnerable to an invalid read of size 4 due to NULL pointer dereferencing of\n  _bfd_elf_large_com_section. This vulnerability caused programs that conduct an\n  analysis of binary programs using the libbfd library, such as objcopy, to crash\n  (bsc#1037061).\n- CVE-2017-8396: The Binary File Descriptor (BFD) library (aka libbfd) was\n  vulnerable to an invalid read of size 1 because the existing reloc offset range\n  tests didn't catch small negative offsets less than the size of the reloc\n  field. This vulnerability caused programs that conduct an analysis of binary\n  programs using the libbfd library, such as objdump, to crash (bsc#1037066).\n- CVE-2017-8421: The function coff_set_alignment_hook in Binary File Descriptor\n  (BFD) library (aka libbfd) had a memory leak vulnerability which can cause\n  memory exhaustion in objdump via a crafted PE file (bsc#1037273).\n- CVE-2017-9746: The disassemble_bytes function in objdump.c allowed remote\n  attackers to cause a denial of service (buffer overflow and application crash)\n  or possibly have unspecified other impact via a crafted binary file, as\n  demonstrated by mishandling of rae insns printing for this file during 'objdump\n  -D' execution (bsc#1044891).\n- CVE-2017-9747: The ieee_archive_p function in the Binary File Descriptor\n  (BFD) library (aka libbfd) might have allowed remote attackers to cause a\n  denial of service (buffer overflow and application crash) or possibly have\n  unspecified other impact via a crafted binary file, as demonstrated by\n  mishandling of this file during 'objdump -D' execution (bsc#1044897).\n- CVE-2017-9748: The ieee_object_p function in the Binary File Descriptor (BFD)\n  library (aka libbfd) might have allowed remote attackers to cause a denial of\n  service (buffer overflow and application crash) or possibly have unspecified\n  other impact via a crafted binary file, as demonstrated by mishandling of this\n  file during 'objdump -D' execution (bsc#1044901).\n- CVE-2017-9750: opcodes/rx-decode.opc lacked bounds checks for certain scale\n  arrays, which allowed remote attackers to cause a denial of service (buffer\n  overflow and application crash) or possibly have unspecified other impact via a\n  crafted binary file, as demonstrated by mishandling of this file during\n  'objdump -D' execution (bsc#1044909).\n- CVE-2017-9755: Not considering the the number of registers for bnd mode\n  allowed remote attackers to cause a denial of service (buffer overflow and\n  application crash) or possibly have unspecified other impact via a crafted\n  binary file, as demonstrated by mishandling of this file during 'objdump -D'\n  execution (bsc#1044925).\n- CVE-2017-9756: The aarch64_ext_ldst_reglist function allowed remote attackers\n  to cause a denial of service (buffer overflow and application crash) or\n  possibly have unspecified other impact via a crafted binary file, as\n  demonstrated by mishandling of this file during 'objdump -D' execution\n  (bsc#1044927).\n- CVE-2017-7209: The dump_section_as_bytes function in readelf accessed a NULL\n  pointer while reading section contents in a corrupt binary, leading to a\n  program crash (bsc#1030298).\n- CVE-2017-6965: readelf wrote to illegal addresses while processing corrupt\n  input files containing symbol-difference relocations, leading to a heap-based\n  buffer overflow (bsc#1029909).\n- CVE-2017-6966: readelf had a use-after-free (specifically read-after-free)\n  error while processing multiple, relocated sections in an MSP430 binary. This\n  is caused by mishandling of an invalid symbol index, and mishandling of state\n  across invocations (bsc#1029908).\n- CVE-2017-6969: readelf was vulnerable to a heap-based buffer over-read while\n  processing corrupt RL78 binaries. The vulnerability can trigger program\n  crashes. It may lead to an information leak as well (bsc#1029907).\n- CVE-2017-7210: objdump was vulnerable to multiple heap-based buffer\n  over-reads (of size 1 and size 8) while handling corrupt STABS enum type\n  strings in a crafted object file, leading to program crash (bsc#1030297).\n  ",
	"affected": [
		{
			"package": {
				"ecosystem": "SUSE:OpenStack Cloud 7",
				"name": "binutils",
				"purl": "purl:rpm/suse/binutils&distro=SUSE%20OpenStack%20Cloud%207"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "2.31-9.26.1"
						}
					]
				}
			],
			"ecosystem_specific": {
				"binaries": [
					{
						"binutils": "2.31-9.26.1"
					}
				]
			}
		},
		{
			"package": {
				"ecosystem": "SUSE:Linux Enterprise Desktop 12 SP3",
				"name": "binutils",
				"purl": "purl:rpm/suse/binutils&distro=SUSE%20Linux%20Enterprise%20Desktop%2012%20SP3"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "2.31-9.26.1"
						}
					]
				}
			],
			"ecosystem_specific": {
				"binaries": [
					{
						"binutils": "2.31-9.26.1"
					}
				]
			}
		},
		{
			"package": {
				"ecosystem": "SUSE:Linux Enterprise Server for SAP Applications 12 SP1",
				"name": "binutils",
				"purl": "purl:rpm/suse/binutils&distro=SUSE%20Linux%20Enterprise%20Server%20for%20SAP%20Applications%2012%20SP1"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "2.31-9.26.1"
						}
					]
				}
			],
			"ecosystem_specific": {
				"binaries": [
					{
						"binutils": "2.31-9.26.1"
					}
				]
			}
		},
		{
			"package": {
				"ecosystem": "SUSE:Linux Enterprise Server for SAP Applications 12 SP2",
				"name": "binutils",
				"purl": "purl:rpm/suse/binutils&distro=SUSE%20Linux%20Enterprise%20Server%20for%20SAP%20Applications%2012%20SP2"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "2.31-9.26.1"
						}
					]
				}
			],
			"ecosystem_specific": {
				"binaries": [
					{
						"binutils": "2.31-9.26.1"
					}
				]
			}
		},
		{
			"package": {
				"ecosystem": "SUSE:Linux Enterprise Software Development Kit 12 SP3",
				"name": "binutils",
				"purl": "purl:rpm/suse/binutils&distro=SUSE%20Linux%20Enterprise%20Software%20Development%20Kit%2012%20SP3"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "2.31-9.26.1"
						}
					]
				}
			],
			"ecosystem_specific": {
				"binaries": [
					{
						"binutils-devel": "2.31-9.26.1",
						"binutils-gold": "2.31-9.26.1",
						"cross-ppc-binutils": "2.31-9.26.1",
						"cross-spu-binutils": "2.31-9.26.1"
					}
				]
			}
		},
		{
			"package": {
				"ecosystem": "SUSE:Linux Enterprise Software Development Kit 12 SP3",
				"name": "cross-ppc-binutils",
				"purl": "purl:rpm/suse/cross-ppc-binutils&distro=SUSE%20Linux%20Enterprise%20Software%20Development%20Kit%2012%20SP3"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "2.31-9.26.1"
						}
					]
				}
			],
			"ecosystem_specific": {
				"binaries": [
					{
						"binutils-devel": "2.31-9.26.1",
						"binutils-gold": "2.31-9.26.1",
						"cross-ppc-binutils": "2.31-9.26.1",
						"cross-spu-binutils": "2.31-9.26.1"
					}
				]
			}
		},
		{
			"package": {
				"ecosystem": "SUSE:Linux Enterprise Software Development Kit 12 SP3",
				"name": "cross-spu-binutils",
				"purl": "purl:rpm/suse/cross-spu-binutils&distro=SUSE%20Linux%20Enterprise%20Software%20Development%20Kit%2012%20SP3"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "2.31-9.26.1"
						}
					]
				}
			],
			"ecosystem_specific": {
				"binaries": [
					{
						"binutils-devel": "2.31-9.26.1",
						"binutils-gold": "2.31-9.26.1",
						"cross-ppc-binutils": "2.31-9.26.1",
						"cross-spu-binutils": "2.31-9.26.1"
					}
				]
			}
		},
		{
			"package": {
				"ecosystem": "SUSE:Linux Enterprise Server 12-LTSS",
				"name": "binutils",
				"purl": "purl:rpm/suse/binutils&distro=SUSE%20Linux%20Enterprise%20Server%2012-LTSS"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "2.31-9.26.1"
						}
					]
				}
			],
			"ecosystem_specific": {
				"binaries": [
					{
						"binutils": "2.31-9.26.1"
					}
				]
			}
		},
		{
			"package": {
				"ecosystem": "SUSE:Linux Enterprise Server 12 SP1-LTSS",
				"name": "binutils",
				"purl": "purl:rpm/suse/binutils&distro=SUSE%20Linux%20Enterprise%20Server%2012%20SP1-LTSS"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "2.31-9.26.1"
						}
					]
				}
			],
			"ecosystem_specific": {
				"binaries": [
					{
						"binutils": "2.31-9.26.1"
					}
				]
			}
		},
		{
			"package": {
				"ecosystem": "SUSE:Linux Enterprise Server 12 SP2-LTSS",
				"name": "binutils",
				"purl": "purl:rpm/suse/binutils&distro=SUSE%20Linux%20Enterprise%20Server%2012%20SP2-LTSS"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "2.31-9.26.1"
						}
					]
				}
			],
			"ecosystem_specific": {
				"binaries": [
					{
						"binutils": "2.31-9.26.1"
					}
				]
			}
		},
		{
			"package": {
				"ecosystem": "SUSE:Linux Enterprise Server 12 SP3",
				"name": "binutils",
				"purl": "purl:rpm/suse/binutils&distro=SUSE%20Linux%20Enterprise%20Server%2012%20SP3"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "2.31-9.26.1"
						}
					]
				}
			],
			"ecosystem_specific": {
				"binaries": [
					{
						"binutils": "2.31-9.26.1"
					}
				]
			}
		},
		{
			"package": {
				"ecosystem": "SUSE:Linux Enterprise Server for SAP Applications 12 SP3",
				"name": "binutils",
				"purl": "purl:rpm/suse/binutils&distro=SUSE%20Linux%20Enterprise%20Server%20for%20SAP%20Applications%2012%20SP3"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "2.31-9.26.1"
						}
					]
				}
			],
			"ecosystem_specific": {
				"binaries": [
					{
						"binutils": "2.31-9.26.1"
					}
				]
			}
		},
		{
			"package": {
				"ecosystem": "SUSE:Enterprise Storage 4",
				"name": "binutils",
				"purl": "purl:rpm/suse/binutils&distro=SUSE%20Enterprise%20Storage%204"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "2.31-9.26.1"
						}
					]
				}
			],
			"ecosystem_specific": {
				"binaries": [
					{
						"binutils": "2.31-9.26.1"
					}
				]
			}
		}
	],
	"references": [
		{
			"type": "ADVISORY",
			"url": "https://www.suse.com/support/update/announcement/2018/suse-su-20183207-1/"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1029907"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1029908"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1029909"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1030296"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1030297"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1030298"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1030584"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1030585"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1030588"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1030589"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1031590"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1031593"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1031595"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1031638"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1031644"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1031656"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1037052"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1037057"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1037061"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1037066"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1037273"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1044891"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1044897"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1044901"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1044909"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1044925"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1044927"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1065643"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1065689"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1065693"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1068640"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1068643"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1068887"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1068888"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1068950"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1069176"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1069202"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1074741"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1077745"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1079103"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1079741"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1080556"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1081527"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1083528"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1083532"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1085784"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1086608"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1086784"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1086786"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1086788"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1090997"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1091015"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1091365"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1091368"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2014-9939"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2017-15938"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2017-15939"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2017-15996"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2017-16826"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2017-16827"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2017-16828"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2017-16829"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2017-16830"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2017-16831"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2017-16832"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2017-6965"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2017-6966"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2017-6969"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2017-7209"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2017-7210"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2017-7223"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2017-7224"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2017-7225"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2017-7226"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2017-7299"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2017-7300"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2017-7301"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2017-7302"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2017-7303"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2017-7304"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2017-8392"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2017-8393"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2017-8394"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2017-8396"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2017-8421"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2017-9746"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2017-9747"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2017-9748"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2017-9750"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2017-9755"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2017-9756"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2018-10372"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2018-10373"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2018-10534"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2018-10535"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2018-6323"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2018-6543"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2018-6759"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2018-6872"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2018-7208"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2018-7568"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2018-7569"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2018-7570"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2018-7642"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2018-7643"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2018-8945"
		}
	]
}
