{
	"id": "SUSE-SU-2018:0698-1",
	"modified": "2018-03-15T15:55:42Z",
	"published": "2018-03-15T15:55:42Z",
	"related": [
		"CVE-2017-10268",
		"CVE-2017-10378",
		"CVE-2018-2562",
		"CVE-2018-2612",
		"CVE-2018-2622",
		"CVE-2018-2640",
		"CVE-2018-2665",
		"CVE-2018-2668"
	],
	"summary": "Security update for mariadb",
	"details": "\n\nThis update for mariadb to 10.0.34 fixes several issues.\n\nThese security issues were fixed:\n\n- CVE-2017-10378: Vulnerability in subcomponent: Server: Optimizer. Easily exploitable vulnerability allowed low privileged attacker with network access via multiple protocols to compromise MySQL Server. Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) (bsc#1064115).\n- CVE-2017-10268: Vulnerability in subcomponent: Server: Replication. Difficult to exploit vulnerability allowed high privileged attacker with logon to the infrastructure where MySQL Server executes to compromise MySQL Server. Successful attacks of this vulnerability can result in unauthorized access to critical data or complete access to all MySQL Server accessible data (bsc#1064101).\n- CVE-2018-2562: Vulnerability in the MySQL Server subcomponent: Server : Partition. Easily exploitable vulnerability allowed low privileged attacker with network access via multiple protocols to compromise MySQL Server. Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of MySQL Server as well as unauthorized update, insert or delete access to some of MySQL Server accessible data.\n- CVE-2018-2622: Vulnerability in the MySQL Server subcomponent: Server: DDL. Easily exploitable vulnerability allowed low privileged attacker with network access via multiple protocols to compromise MySQL Server. Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of MySQL Server.\n- CVE-2018-2640: Vulnerability in the MySQL Server subcomponent: Server: Optimizer. Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of MySQL Server.\n- CVE-2018-2665: Vulnerability in the MySQL Server subcomponent: Server: Optimizer. Easily exploitable vulnerability allowed low privileged attacker with network access via multiple protocols to compromise MySQL Server. Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of MySQL Server.\n- CVE-2018-2668: Vulnerability in the MySQL Server subcomponent: Server: Optimizer. Easily exploitable vulnerability allowed low privileged attacker with network access via multiple protocols to compromise MySQL Server. Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of MySQL Server.\n- CVE-2018-2612: Vulnerability in the MySQL Server subcomponent: InnoDB. Easily exploitable vulnerability allowed high privileged attacker with network access via multiple protocols to compromise MySQL Server. Successful attacks of this vulnerability can result in unauthorized creation, deletion or modification access to critical data or all MySQL Server accessible data and unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of MySQL Server.\n\nThese non-security issues were fixed:\n\n- Relax the required version of mariadb-errormessages to fix the update to MariaDB 10.2. \n  (bsc#1072665)\n- CHECK TABLE no longer returns an error when run on a CONNECT table\n- 'Undo log record is too big.' error occurring in very narrow range of string lengths\n- Race condition between INFORMATION_SCHEMA.INNODB_SYS_TABLESTATS and ALTER/DROP/TRUNCATE TABLE\n- Wrong result after altering a partitioned table fixed bugs in InnoDB FULLTEXT INDEX\n- InnoDB FTS duplicate key error * MDEV-13051: InnoDB crash after failed ADD\n  INDEX and table_definition_cache eviction\n- fts_create_doc_id() unnecessarily allocates 8 bytes for every inserted row\n- IMPORT TABLESPACE may corrupt ROW_FORMAT=REDUNDANT tables\n\nFor additional changes please see https://kb.askmonty.org/en/mariadb-10033-changelog and\nhttps://kb.askmonty.org/en/mariadb-10034-changelog .\n",
	"affected": [
		{
			"package": {
				"ecosystem": "SUSE:Linux Enterprise Server 12-LTSS",
				"name": "mariadb",
				"purl": "pkg:rpm/suse/mariadb&distro=SUSE%20Linux%20Enterprise%20Server%2012-LTSS"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "10.0.34-20.43.1"
						}
					]
				}
			],
			"ecosystem_specific": {
				"binaries": [
					{
						"libmysqlclient-devel": "10.0.34-20.43.1",
						"libmysqlclient18": "10.0.34-20.43.1",
						"libmysqlclient18-32bit": "10.0.34-20.43.1",
						"libmysqlclient_r18": "10.0.34-20.43.1",
						"libmysqld-devel": "10.0.34-20.43.1",
						"libmysqld18": "10.0.34-20.43.1",
						"mariadb": "10.0.34-20.43.1",
						"mariadb-client": "10.0.34-20.43.1",
						"mariadb-errormessages": "10.0.34-20.43.1",
						"mariadb-tools": "10.0.34-20.43.1"
					}
				]
			}
		}
	],
	"references": [
		{
			"type": "ADVISORY",
			"url": "https://www.suse.com/support/update/announcement/2018/suse-su-20180698-1/"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1064101"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1064115"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1072665"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1078431"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2017-10268"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2017-10378"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2018-2562"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2018-2612"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2018-2622"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2018-2640"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2018-2665"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2018-2668"
		}
	]
}
