{
	"id": "SUSE-SU-2022:4439-1",
	"modified": "2022-12-13T07:34:23Z",
	"published": "2022-12-13T07:34:23Z",
	"related": [
		"CVE-2021-36222",
		"CVE-2021-3711",
		"CVE-2021-41174",
		"CVE-2021-41244",
		"CVE-2021-43798",
		"CVE-2021-43813",
		"CVE-2021-43815",
		"CVE-2022-29170",
		"CVE-2022-31097",
		"CVE-2022-31107",
		"CVE-2022-35957",
		"CVE-2022-36062"
	],
	"summary": "Security update for SUSE Manager Client Tools",
	"details": "This update fixes the following issues:\n\ngolang-github-boynux-squid_exporter:\n\n- Exclude s390 architecture\n- Enhanced to build on Enterprise Linux 8\n\ngrafana:\n\n- Version update from 8.3.10 to 8.5.13 (jsc#PED-2145)\n- Security fixes:\n  * CVE-2022-36062: (bsc#1203596)\n  * CVE-2022-35957: (bsc#1203597)\n  * CVE-2022-31107: (bsc#1201539)\n  * CVE-2022-31097: (bsc#1201535)\n  * CVE-2022-29170: (bsc#1199810)\n  * CVE-2021-43813, CVE-2021-43815: (bsc#1193686)\n  * CVE-2021-43798: (bsc#1193492)\n  * CVE-2021-41244: (bsc#1192763)\n  * CVE-2021-41174: (bsc#1192383)\n  * CVE-2021-3711: (bsc#1189520)\n  * CVE-2021-36222: (bsc#1188571)\n- Features and enhancements:\n  * AccessControl: Disable user remove and user update roles when they do not have the permissions\n  * AccessControl: Provisioning for teams\n  * Alerting: Add custom grouping to Alert Panel\n  * Alerting: Add safeguard for migrations that might cause dataloss\n  * Alerting: AlertingProxy to elevate permissions for request forwarded to data proxy when RBAC enabled\n  * Alerting: Grafana uses > instead of >= when checking the For duration\n  * Alerting: Move slow queries in the scheduler to another goroutine\n  * Alerting: Remove disabled flag for data source when migrating alerts\n  * Alerting: Show notification tab of legacy alerting only to editor\n  * Alerting: Update migration to migrate only alerts that belon to existing org\\dashboard\n  * Alerting: Use expanded labels in dashboard annotations\n  * Alerting: Use time.Ticker instead of alerting.Ticker in ngalert\n  * Analytics: Add user id tracking to google analytics\n  * Angular: Add AngularJS plugin support deprecation plan to docs site\n  * API: Add usage stats preview endpoint\n  * API: Extract OpenAPI specification from source code using go-swagger\n  * Auth: implement auto_sign_up for auth.jwt\n  * Azure monitor Logs: Optimize data fetching in resource picker\n  * Azure Monitor Logs: Order subscriptions in resource picker by name\n  * Azure Monitor: Include datasource ref when interpolating variables.\n  * AzureMonitor: Add support for not equals and startsWith operators when creating Azure Metrics dimension filters.\n  * AzureMonitor: Do not quote variables when a custom 'All' variable option is used\n  * AzureMonitor: Filter list of resources by resourceType\n  * AzureMonitor: Update allowed namespaces\n  * BarChart: color by field, x time field, bar radius, label skipping\n  * Chore: Implement OpenTelemetry in Grafana\n  * Cloud Monitoring: Adds metric type to Metric drop down options\n  * CloudMonitor: Correctly encode default project response\n  * CloudWatch: Add all ElastiCache Redis Metrics\n  * CloudWatch: Add Data Lifecycle Manager metrics and dimension\n  * CloudWatch: Add Missing Elasticache Host-level metrics\n  * CloudWatch: Add multi-value template variable support for log group names in logs query builder\n  * CloudWatch: Add new AWS/ES metrics. #43034, @sunker\n  * Cloudwatch: Add support for AWS/PrivateLink* metrics and dimensions\n  * Cloudwatch: Add support for new AWS/RDS EBS* metrics\n  * Cloudwatch: Add syntax highlighting and autocomplete for 'Metric Search'\n  * Cloudwatch: Add template variable query function for listing log groups\n  * Configuration: Add ability to customize okta login button name and icon\n  * Elasticsearch: Add deprecation notice for < 7.10 versions.\n  * Explore: Support custom display label for exemplar links for Prometheus datasource\n  * Hotkeys: Make time range absolute/permanent\n  * InfluxDB: Use backend for influxDB by default via feature toggle\n  * Legend: Use correct unit for percent and count calculations\n  * Logs: Escape windows newline into single newline\n  * Loki: Add unpack to autocomplete suggestions\n  * Loki: Use millisecond steps in Grafana 8.5.x.\n  * Playlists: Enable sharing direct links to playlists\n  * Plugins: Allow using both Function and Class components for app plugins\n  * Plugins: Expose emotion/react to plugins to prevent load failures\n  * Plugins: Introduce HTTP 207 Multi Status response to api/ds/query\n  * Rendering: Add support for renderer token\n  * Setting: Support configuring feature toggles with bools instead of just passing an array\n  * SQLStore: Prevent concurrent migrations\n  * SSE: Add Mode to drop NaN/Inf/Null in Reduction operations\n  * Tempo: Switch out Select with AsyncSelect component to get loading state in Tempo Search\n  * TimeSeries: Add migration for Graph panel's transform series override\n  * TimeSeries: Add support for negative Y and constant transform\n  * TimeSeries: Preserve null/undefined values when performing negative y transform\n  * Traces: Filter by service/span name and operation in Tempo and Jaeger\n  * Transformations: Add 'JSON' field type to ConvertFieldTypeTransformer\n  * Transformations: Add an All Unique Values Reducer\n  * Transformers: avoid error when the ExtractFields source field is missing\n- Breaking changes:\n  * For a data source query made via /api/ds/query:\n    + If the DatasourceQueryMultiStatus feature is enabled and the data source response has an error set as part of the\n      DataResponse, the resulting HTTP status code is now '207 Multi Status' instead of '400 Bad gateway'\n    + If the DatasourceQueryMultiStatus feature is not enabled and the data source response has an error set as part of\n      the DataResponse, the resulting HTTP status code is '400 BadRequest' (no breaking change)\n  * For a proxied request, e.g. Grafana's datasource or plugin proxy: \n    + If the request is cancelled, e.g. from the browser/by the client, the HTTP status code is now '499 Client closed'\n      request instead of 502 Bad gateway If the request times out, e.g. takes longer time than allowed, the HTTP status\n      code is now '504 Gateway timeout' instead of '502 Bad gateway'.\n    + The change in behavior is that negative-valued series are now stacked downwards from 0 (in their own stacks),\n      rather than downwards from the top of the positive stacks. We now automatically group stacks by Draw style, Line\n      interpolation, and Bar alignment, making it impossible to stack bars on top of lines, or smooth lines on top of\n      stepped lines\n    + The meaning of the default data source has now changed from being a persisted property in a panel. Before when\n      you selected the default data source for a panel and later changed the default data source to another data source\n      it would change all panels who were configured to use the default data source. From  now on the default data\n      source is just the default for new panels and changing the default will not impact any currently saved dashboards\n    + The Tooltip component provided by @grafana/ui is no longer automatically interactive (that is you can hover onto\n      it and click a link or select text). It will from now on by default close automatically when you mouse out\n      from the trigger element. To make tooltips behave like before set the new interactive property to true.\n- Deprecations:\n  * /api/tsdb/query API has been deprecated, please use /api/ds/query instead\n  * AngularJS plugin support is now in a deprecated state. The documentation site has an article with more details on why, when, and how\n- Bug fixes:\n  * Alerting: Add contact points provisioning API\n  * Alerting: add field for custom slack endpoint\n  * Alerting: Add resolved count to notification title when both firing and resolved present\n  * Alerting: Alert rule should wait For duration when execution error state is Alerting\n  * Alerting: Allow disabling override timings for notification policies\n  * Alerting: Allow serving images from custom url path\n  * Alerting: Apply Custom Headers to datasource queries\n  * Alerting: Classic conditions can now display multiple values\n  * Alerting: correctly show all alerts in a folder\n  * Alerting: Display query from grafana-managed alert rules on /api/v1/rules\n  * Alerting: Do not overwrite existing alert rule condition\n  * Alerting: Enhance support for arbitrary group names in managed alerts\n  * Alerting: Fix access to alerts for viewer with editor permissions when RBAC is disabled\n  * Alerting: Fix anonymous access to alerting\n  * Alerting: Fix migrations by making send_alerts_to field nullable\n  * Alerting: Fix RBAC actions for notification policies\n  * Alerting: Fix use of > instead of >= when checking the For duration\n  * Alerting: Remove double quotes from matchers\n  * API: Include userId, orgId, uname in request logging middleware\n  * Auth: Guarantee consistency of signed SigV4 headers\n  * Azure Monitor : Adding json formatting of error messages in Panel Header Corner and Inspect Error Tab\n  * Azure Monitor: Add 2 more Curated Dashboards for VM Insights\n  * Azure Monitor: Bug Fix for incorrect variable cascading for template variables\n  * Azure Monitor: Fix space character encoding for metrics query link to Azure Portal\n  * Azure Monitor: Fixes broken log queries that use workspace\n  * Azure Monitor: Small bug fixes for Resource Picker\n  * AzureAd Oauth: Fix strictMode to reject users without an assigned role\n  * AzureMonitor: Fixes metric definition for Azure Storage queue/file/blob/table resources\n  * Cloudwatch : Fixed reseting metric name when changing namespace in Metric Query\n  * CloudWatch: Added missing MemoryDB Namespace metrics\n  * CloudWatch: Fix MetricName resetting on Namespace change.\n  * Cloudwatch: Fix template variables in variable queries.\n  * CloudWatch: Fix variable query tag migration\n  * CloudWatch: Handle new error codes for MetricInsights\n  * CloudWatch: List all metrics properly in SQL autocomplete\n  * CloudWatch: Prevent log groups from being removed on query change\n  * CloudWatch: Remove error message when using multi-valued template vars in region field\n  * CloudWatch: Run query on blur in logs query field\n  * CloudWatch: Use default http client from aws-sdk-go\n  * Dashboard: Fix dashboard update permission check\n  * Dashboard: Fixes random scrolling on time range change\n  * Dashboard: Template variables are now correctly persisted when clicking breadcrumb links\n  * DashboardExport: Fix exporting and importing dashboards where query data source ended up as incorrect\n  * DashboardPage: Remember scroll position when coming back panel edit / view panel\n  * Dashboards: Fixes repeating by row and no refresh\n  * Dashboards: Show changes in save dialog\n  * DataSource: Default data source is no longer a persisted state but just the default data source for new panels\n  * DataSourcePlugin API: Allow queries import when changing data source type\n  * Elasticsearch: Respect maxConcurrentShardRequests datasource setting\n  * Explore: Allow users to save Explore state to a new panel in a new dashboard\n  * Explore: Avoid locking timepicker when range is inverted.\n  * Explore: Fix closing split pane when logs panel is used\n  * Explore: Prevent direct access to explore if disabled via feature toggle\n  * Explore: Remove return to panel button\n  * FileUpload: clicking the Upload file button now opens their modal correctly\n  * Gauge: Fixes blank viz when data link exists and orientation was horizontal\n  * GrafanaUI: Fix color of links in error Tooltips in light theme\n  * Histogram Panel: Take decimal into consideration\n  * InfluxDB: Fixes invalid no data alerts. #48295, @yesoreyeram\n  * Instrumentation: Fix HTTP request instrumentation of authentication failures\n  * Instrumentation: Make backend plugin metrics endpoints available with optional authentication\n  * Instrumentation: Proxy status code correction and various improvements\n  * LibraryPanels: Fix library panels not connecting properly in imported dashboards\n  * LibraryPanels: Prevent long descriptions and names from obscuring the delete button\n  * Logger: Use specified format for file logger\n  * Logging: Introduce feature toggle to activate gokit/log format\n  * Logs: Handle missing fields in dataframes better\n  * Loki: Improve unpack parser handling\n  * ManageDashboards: Fix error when deleting all dashboards from folder view\n  * Middleware: Fix IPv6 host parsing in CSRF check\n  * Navigation: Prevent navbar briefly showing on login\n  * NewsPanel: Add support for Atom feeds. #45390, @kaydelaney\n  * OAuth: Fix parsing of ID token if header contains non-string value\n  * Panel Edit: Options search now works correctly when a logarithmic scale option is set\n  * Panel Edit: Visualization search now works correctly with special characters\n  * Plugins Catalog: Fix styling of hyperlinks\n  * Plugins: Add deprecation notice for /api/tsdb/query endpoint\n  * Plugins: Adding support for traceID field to accept variables\n  * Plugins: Ensure catching all appropriate 4xx api/ds/query scenarios\n  * Postgres: Return tables with hyphenated schemes\n  * PostgreSQL: __unixEpochGroup to support arithmetic expression as argument\n  * Profile/Help: Expose option to disable profile section and help menu\n  * Prometheus: Enable new visual query builder by default\n  * Provisioning: Fix duplicate validation when multiple organizations have been configured inserted\n  * RBAC: Fix Anonymous Editors missing dashboard controls\n  * RolePicker: Fix menu position on smaller screens\n  * SAML: Allow disabling of SAML signups\n  * Search: Sort results correctly when using postgres\n  * Security: Fixes minor code scanning security warnings in old vendored javascript libs\n  * Table panel: Fix horizontal scrolling when pagination is enabled\n  * Table panel: Show datalinks for cell display modes JSON View and Gauge derivates\n  * Table: Fix filter crashes table\n  * Table: New pagination option\n  * TablePanel: Add cell inspect option\n  * TablePanel: Do not prefix columns with frame name if multipleframes and override active\n  * TagsInput: Fix tags remove button accessibility issues\n  * Tempo / Trace Viewer: Support Span Links in Trace Viewer\n  * Tempo: Download span references in data inspector\n  * Tempo: Separate trace to logs and loki search datasource config\n  * TextPanel: Sanitize after markdown has been rendered to html\n  * TimeRange: Fixes updating time range from url and browser history\n  * TimeSeries: Fix detection & rendering of sparse datapoints\n  * Timeseries: Fix outside range stale state\n  * TimeSeries: Properly stack series with missing datapoints\n  * TimeSeries: Sort tooltip values based on raw values\n  * Tooltip: Fix links not legible in Tooltips when using light theme\n  * Tooltip: Sort decimals using standard numeric compare\n  * Trace View: Show number of child spans\n  * Transformations: Support escaped characters in key-value pair parsing\n  * Transforms: Labels to fields, fix label picker layout\n  * Variables: Ensure variables in query params are correctly recognised\n  * Variables: Fix crash when changing query variable datasource\n  * Variables: Fixes issue with data source variables not updating queries with variable\n  * Visualizations: Stack negative-valued series downwards\n- Plugin development fixes:\n  * Card: Increase clickable area when meta items are present.\n  * ClipboardButton: Use a fallback when the Clipboard API is unavailable\n  * Loki: Fix operator description propup from being shortened.\n  * OAuth: Add setting to skip org assignment for external users\n  * Tooltips: Make tooltips non interactive by default\n  * Tracing: Add option to map tag names to log label names in trace to logs settings\n\nprometheus-blackbox_exporter:\n\n- Add requirement for go1.18 (bsc#1203599)\n\nspacecmd:\n\n- Version 4.3.16-1\n  * Fix dict_keys not supporting indexing in systems_setconfigchannelorger\n  * Improve Proxy FQDN hint message\n  * Added a warning message for traditional stack deprecation\n  * Stop always showing help for valid proxy_container_config calls\n  * Remove 'Undefined return code' from debug messages (bsc#1203283)\n\nspacewalk-client-tools:\n\n- Version 4.3.13-1\n  * Update translation strings\n\n",
	"affected": [
		{
			"package": {
				"ecosystem": "SUSE:Manager Tools 12",
				"name": "golang-github-boynux-squid_exporter",
				"purl": "purl:rpm/suse/golang-github-boynux-squid_exporter&distro=SUSE%20Manager%20Tools%2012"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "1.6-1.9.1"
						}
					]
				}
			],
			"ecosystem_specific": {
				"binaries": [
					{
						"golang-github-boynux-squid_exporter": "1.6-1.9.1",
						"grafana": "8.5.13-1.36.2",
						"prometheus-blackbox_exporter": "0.19.0-1.14.1",
						"python2-spacewalk-check": "4.3.13-52.80.1",
						"python2-spacewalk-client-setup": "4.3.13-52.80.1",
						"python2-spacewalk-client-tools": "4.3.13-52.80.1",
						"spacecmd": "4.3.16-38.112.1",
						"spacewalk-check": "4.3.13-52.80.1",
						"spacewalk-client-setup": "4.3.13-52.80.1",
						"spacewalk-client-tools": "4.3.13-52.80.1"
					}
				]
			}
		},
		{
			"package": {
				"ecosystem": "SUSE:Manager Tools 12",
				"name": "grafana",
				"purl": "purl:rpm/suse/grafana&distro=SUSE%20Manager%20Tools%2012"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "8.5.13-1.36.2"
						}
					]
				}
			],
			"ecosystem_specific": {
				"binaries": [
					{
						"golang-github-boynux-squid_exporter": "1.6-1.9.1",
						"grafana": "8.5.13-1.36.2",
						"prometheus-blackbox_exporter": "0.19.0-1.14.1",
						"python2-spacewalk-check": "4.3.13-52.80.1",
						"python2-spacewalk-client-setup": "4.3.13-52.80.1",
						"python2-spacewalk-client-tools": "4.3.13-52.80.1",
						"spacecmd": "4.3.16-38.112.1",
						"spacewalk-check": "4.3.13-52.80.1",
						"spacewalk-client-setup": "4.3.13-52.80.1",
						"spacewalk-client-tools": "4.3.13-52.80.1"
					}
				]
			}
		},
		{
			"package": {
				"ecosystem": "SUSE:Manager Tools 12",
				"name": "prometheus-blackbox_exporter",
				"purl": "purl:rpm/suse/prometheus-blackbox_exporter&distro=SUSE%20Manager%20Tools%2012"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "0.19.0-1.14.1"
						}
					]
				}
			],
			"ecosystem_specific": {
				"binaries": [
					{
						"golang-github-boynux-squid_exporter": "1.6-1.9.1",
						"grafana": "8.5.13-1.36.2",
						"prometheus-blackbox_exporter": "0.19.0-1.14.1",
						"python2-spacewalk-check": "4.3.13-52.80.1",
						"python2-spacewalk-client-setup": "4.3.13-52.80.1",
						"python2-spacewalk-client-tools": "4.3.13-52.80.1",
						"spacecmd": "4.3.16-38.112.1",
						"spacewalk-check": "4.3.13-52.80.1",
						"spacewalk-client-setup": "4.3.13-52.80.1",
						"spacewalk-client-tools": "4.3.13-52.80.1"
					}
				]
			}
		},
		{
			"package": {
				"ecosystem": "SUSE:Manager Tools 12",
				"name": "spacecmd",
				"purl": "purl:rpm/suse/spacecmd&distro=SUSE%20Manager%20Tools%2012"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "4.3.16-38.112.1"
						}
					]
				}
			],
			"ecosystem_specific": {
				"binaries": [
					{
						"golang-github-boynux-squid_exporter": "1.6-1.9.1",
						"grafana": "8.5.13-1.36.2",
						"prometheus-blackbox_exporter": "0.19.0-1.14.1",
						"python2-spacewalk-check": "4.3.13-52.80.1",
						"python2-spacewalk-client-setup": "4.3.13-52.80.1",
						"python2-spacewalk-client-tools": "4.3.13-52.80.1",
						"spacecmd": "4.3.16-38.112.1",
						"spacewalk-check": "4.3.13-52.80.1",
						"spacewalk-client-setup": "4.3.13-52.80.1",
						"spacewalk-client-tools": "4.3.13-52.80.1"
					}
				]
			}
		},
		{
			"package": {
				"ecosystem": "SUSE:Manager Tools 12",
				"name": "spacewalk-client-tools",
				"purl": "purl:rpm/suse/spacewalk-client-tools&distro=SUSE%20Manager%20Tools%2012"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "4.3.13-52.80.1"
						}
					]
				}
			],
			"ecosystem_specific": {
				"binaries": [
					{
						"golang-github-boynux-squid_exporter": "1.6-1.9.1",
						"grafana": "8.5.13-1.36.2",
						"prometheus-blackbox_exporter": "0.19.0-1.14.1",
						"python2-spacewalk-check": "4.3.13-52.80.1",
						"python2-spacewalk-client-setup": "4.3.13-52.80.1",
						"python2-spacewalk-client-tools": "4.3.13-52.80.1",
						"spacecmd": "4.3.16-38.112.1",
						"spacewalk-check": "4.3.13-52.80.1",
						"spacewalk-client-setup": "4.3.13-52.80.1",
						"spacewalk-client-tools": "4.3.13-52.80.1"
					}
				]
			}
		}
	],
	"references": [
		{
			"type": "ADVISORY",
			"url": "https://www.suse.com/support/update/announcement/2022/suse-su-20224439-1/"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1188571"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1189520"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1192383"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1192763"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1193492"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1193686"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1199810"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1201535"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1201539"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1202945"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1203283"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1203596"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1203597"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1203599"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2021-36222"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2021-3711"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2021-41174"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2021-41244"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2021-43798"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2021-43813"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2021-43815"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2022-29170"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2022-31097"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2022-31107"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2022-35957"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2022-36062"
		}
	]
}
