{
	"id": "SUSE-SU-2021:3748-1",
	"modified": "2021-11-19T16:17:29Z",
	"published": "2021-11-19T16:17:29Z",
	"related": [
		"CVE-2018-13405",
		"CVE-2021-33033",
		"CVE-2021-34556",
		"CVE-2021-3542",
		"CVE-2021-35477",
		"CVE-2021-3655",
		"CVE-2021-3715",
		"CVE-2021-37159",
		"CVE-2021-3760",
		"CVE-2021-41864",
		"CVE-2021-42008",
		"CVE-2021-42252",
		"CVE-2021-42739"
	],
	"summary": "Security update for the Linux Kernel",
	"details": "The SUSE Linux Enterprise 12 SP5 kernel was updated to receive various security and bugfixes.\n\n\nThe following security bugs were fixed:\n\n- CVE-2021-3655: Fixed a missing size validations on inbound SCTP packets, which may have allowed the kernel to read uninitialized memory (bsc#1188563).\n- CVE-2021-3715: Fixed a use-after-free in route4_change() in net/sched/cls_route.c (bsc#1190349).\n- CVE-2021-33033: Fixed a use-after-free in cipso_v4_genopt in net/ipv4/cipso_ipv4.c because the CIPSO and CALIPSO refcounting for the DOI definitions is mishandled (bsc#1186109).\n- CVE-2021-3760: Fixed a use-after-free vulnerability with the ndev->rf_conn_info object (bsc#1190067).\n- CVE-2021-42739: The firewire subsystem had a buffer overflow related to drivers/media/firewire/firedtv-avc.c and drivers/media/firewire/firedtv-ci.c, because avc_ca_pmt mishandled bounds checking (bsc#1184673).\n- CVE-2021-3542: Fixed heap buffer overflow in firedtv driver (bsc#1186063).\n- CVE-2021-34556: Fixed side-channel attack via a Speculative Store Bypass via unprivileged BPF program that could have obtain sensitive information from kernel memory (bsc#1188983).\n- CVE-2021-35477: Fixed BPF stack frame pointer which could have been abused to disclose content of arbitrary kernel memory (bsc#1188985).\n- CVE-2021-42252: Fixed an issue inside aspeed_lpc_ctrl_mmap that could have allowed local attackers to access the Aspeed LPC control interface to overwrite memory in the kernel and potentially execute privileges (bnc#1190479).\n- CVE-2021-41864: Fixed prealloc_elems_and_freelist that allowed unprivileged users to trigger an eBPF multiplication integer overflow with a resultant out-of-bounds write (bnc#1191317).\n- CVE-2021-42008: Fixed a slab out-of-bounds write in the decode_data function in drivers/net/hamradio/6pack.c. Input from a process that had the CAP_NET_ADMIN capability could have lead to root access (bsc#1191315).\n- CVE-2021-37159: Fixed use-after-free and a double free inside hso_free_net_device in drivers/net/usb/hso.c when unregister_netdev is called without checking for the NETREG_REGISTERED state (bnc#1188601).\n\n\n\nThe following non-security bugs were fixed:\n\n- IB/hfi1: Fix abba locking issue with sc_disable() (git-fixes)\n- KVM: PPC: Book3S HV: Save host FSCR in the P7/8 path (bsc#1065729).\n- NFS: Do uncached readdir when we're seeking a cookie in an empty page cache (bsc#1191628).\n- NFS: Fix backport error - dir_cookie is a pointer to a u64, not a u64.\n- PM: base: power: do not try to use non-existing RTC for storing data (git-fixes).\n- SMB3.1.1: Fix ids returned in POSIX query dir (bsc#1190317).\n- SMB3.1.1: do not log warning message if server does not populate salt (bsc#1190317).\n- SMB3.1.1: fix mount failure to some servers when compression enabled (bsc#1190317).\n- SMB3.1.1: remove confusing mount warning when no SPNEGO info on negprot rsp (bsc#1190317).\n- SMB3.1.1: update comments clarifying SPNEGO info in negprot response (bsc#1190317).\n- SMB3: Add new info level for query directory (bsc#1190317).\n- SMB3: Add support for getting and setting SACLs (bsc#1190317).\n- SMB3: Fix mkdir when idsfromsid configured on mount (bsc#1190317).\n- SMB3: Resolve data corruption of TCP server info fields (bsc#1190317).\n- SMB3: add support for recognizing WSL reparse tags (bsc#1190317).\n- SMB3: avoid confusing warning message on mount to Azure (bsc#1190317).\n- SMB3: fix readpage for large swap cache (bsc#1190317).\n- SMB3: incorrect file id in requests compounded with open (bsc#1190317).\n- SMB3: update structures for new compression protocol definitions (bsc#1190317).\n- USB: cdc-acm: fix break reporting (git-fixes).\n- USB: cdc-acm: fix racy tty buffer accesses (git-fixes).\n- USB: iowarrior: fix control-message timeouts (git-fixes).\n- USB: serial: cp210x: add ID for GW Instek GDM-834x Digital Multimeter (git-fixes).\n- USB: serial: keyspan: fix memleak on probe errors (git-fixes).\n- USB: serial: option: add Telit LN920 compositions (git-fixes).\n- USB: serial: option: add device id for Foxconn T99W265 (git-fixes).\n- USB: xhci: dbc: fix tty registration race (git-fixes).\n- bitmap: remove unused function declaration (git-fixes).\n- blktrace: Fix uaf in blk_trace access after removing by sysfs (bsc#1191452).\n- cdc_ncm: Set NTB format again after altsetting switch for Huawei devices (git-fixes).\n- ceph: take snap_empty_lock atomically with snaprealm refcount change (bsc#1191888).\n- cifs: Add get_security_type_str function to return sec type (bsc#1190317).\n- cifs: Avoid field over-reading memcpy() (bsc#1190317).\n- cifs: Change SIDs in ACEs while transferring file ownership (bsc#1190317).\n- cifs: Clarify SMB1 code for POSIX Create (bsc#1190317).\n- cifs: Clarify SMB1 code for POSIX Lock (bsc#1190317).\n- cifs: Clarify SMB1 code for POSIX delete file (bsc#1190317).\n- cifs: Clarify SMB1 code for SetFileSize (bsc#1190317).\n- cifs: Clarify SMB1 code for UnixCreateSymLink (bsc#1190317).\n- cifs: Clarify SMB1 code for UnixSetPathInfo (bsc#1190317).\n- cifs: Clarify SMB1 code for delete (bsc#1190317).\n- cifs: Clarify SMB1 code for rename open file (bsc#1190317).\n- cifs: Display local UID details for SMB sessions in DebugData (bsc#1190317).\n- cifs: Do not use the original cruid when following DFS links for multiuser mounts (bsc#1190317).\n- cifs: Enable sticky bit with cifsacl mount option (bsc#1190317).\n- cifs: Fix cached_fid refcnt leak in open_shroot (bsc#1190317).\n- cifs: Fix chmod with modefromsid when an older ACE already exists (bsc#1190317).\n- cifs: Fix cifsacl ACE mask for group and others (bsc#1190317).\n- cifs: Fix double add page to memcg when cifs_readpages (bsc#1190317).\n- cifs: Fix in error types returned for out-of-credit situations (bsc#1190317).\n- cifs: Fix unix perm bits to cifsacl conversion for 'other' bits (bsc#1190317).\n- cifs: Grab a reference for the dentry of the cached directory during the lifetime of the cache (bsc#1190317).\n- cifs: If a corrupted DACL is returned by the server, bail out (bsc#1190317).\n- cifs: Make extract_hostname function public (bsc#1190317).\n- cifs: Make extract_sharename function public (bsc#1190317).\n- cifs: Print the address and port we are connecting to in generic_ip_connect() (bsc#1190317).\n- cifs: Retain old ACEs when converting between mode bits and ACL (bsc#1190317).\n- cifs: Silently ignore unknown oplock break handle (bsc#1190317).\n- cifs: add FALLOC_FL_INSERT_RANGE support (bsc#1190317).\n- cifs: add a function to get a cached dir based on its dentry (bsc#1190317).\n- cifs: add a timestamp to track when the lease of the cached dir was taken (bsc#1190317).\n- cifs: add shutdown support (bsc#1190317).\n- cifs: add support for FALLOC_FL_COLLAPSE_RANGE (bsc#1190317).\n- cifs: added WARN_ON for all the count decrements (bsc#1190317).\n- cifs: ask for more credit on async read/write code paths (bsc#1190317).\n- cifs: avoid extra calls in posix_info_parse (bsc#1190317).\n- cifs: check pointer before freeing (bsc#1190317).\n- cifs: check the timestamp for the cached dirent when deciding on revalidate (bsc#1190317).\n- cifs: clarify SMB1 code for UnixCreateHardLink (bsc#1190317).\n- cifs: cleanup a few le16 vs. le32 uses in cifsacl.c (bsc#1190317).\n- cifs: cleanup misc.c (bsc#1190317).\n- cifs: compute full_path already in cifs_readdir() (bsc#1190317).\n- cifs: constify path argument of ->make_node() (bsc#1190317).\n- cifs: constify pathname arguments in a bunch of helpers (bsc#1190317).\n- cifs: convert list_for_each to entry variant in cifs_debug.c (bsc#1190317).\n- cifs: convert list_for_each to entry variant in smb2misc.c (bsc#1190317).\n- cifs: convert to use be32_add_cpu() (bsc#1190317).\n- cifs: create sd context must be a multiple of 8 (bsc#1190317).\n- cifs: detect dead connections only when echoes are enabled (bsc#1190317).\n- cifs: do not fail __smb_send_rqst if non-fatal signals are pending (bsc#1190317).\n- cifs: dump Security Type info in DebugData (bsc#1190317).\n- cifs: fix DFS mount with cifsacl/modefromsid (bsc#1190317).\n- cifs: fix NULL dereference in smb2_check_message() (bsc#1190317).\n- cifs: fix SMB1 error path in cifs_get_file_info_unix (bsc#1190317).\n- cifs: fix a memleak with modefromsid (bsc#1190317).\n- cifs: fix allocation size on newly created files (bsc#1190317).\n- cifs: fix chown and chgrp when idsfromsid mount option enabled (bsc#1190317).\n- cifs: fix fallocate when trying to allocate a hole (bsc#1190317).\n- cifs: fix leaked reference on requeued write (bsc#1190317).\n- cifs: fix missing null session check in mount (bsc#1190317).\n- cifs: fix missing spinlock around update to ses->status (bsc#1190317).\n- cifs: fix out-of-bound memory access when calling smb3_notify() at mount point (bsc#1190317).\n- cifs: fix reference leak for tlink (bsc#1190317).\n- cifs: fix rsize/wsize to be negotiated values (bsc#1190317).\n- cifs: fix string declarations and assignments in tracepoints (bsc#1190317).\n- cifs: fix the out of range assignment to bit fields in parse_server_interfaces (bsc#1190317).\n- cifs: handle 'nolease' option for vers=1.0 (bsc#1190317).\n- cifs: handle -EINTR in cifs_setattr (bsc#1190317).\n- cifs: handle ERRBaduid for SMB1 (bsc#1190317).\n- cifs: handle reconnect of tcon when there is no cached dfs referral (bsc#1190317).\n- cifs: have ->mkdir() handle race with another client sanely (bsc#1190317).\n- cifs: improve fallocate emulation (bsc#1190317).\n- cifs: make build_path_from_dentry() return const char * (bsc#1190317).\n- cifs: make const array static, makes object smaller (bsc#1190317).\n- cifs: make locking consistent around the server session status (bsc#1190317).\n- cifs: map STATUS_ACCOUNT_LOCKED_OUT to -EACCES (bsc#1190317).\n- cifs: minor kernel style fixes for comments (bsc#1190317).\n- cifs: minor simplification to smb2_is_network_name_deleted (bsc#1190317).\n- cifs: missing null check for newinode pointer (bsc#1190317).\n- cifs: move some variables off the stack in smb2_ioctl_query_info (bsc#1190317).\n- cifs: move the check for nohandlecache into open_shroot (bsc#1190317).\n- cifs: only write 64kb at a time when fallocating a small region of a file (bsc#1190317).\n- cifs: pass a path to open_shroot and check if it is the root or not (bsc#1190317).\n- cifs: pass the dentry instead of the inode down to the revalidation check functions (bsc#1190317).\n- cifs: prevent truncation from long to int in wait_for_free_credits (bsc#1190317).\n- cifs: reduce stack use in smb2_compound_op (bsc#1190317).\n- cifs: refactor create_sd_buf() and and avoid corrupting the buffer (bsc#1190317).\n- cifs: remove old dead code (bsc#1190317).\n- cifs: remove some minor warnings pointed out by kernel test robot (bsc#1190317).\n- cifs: remove the retry in cifs_poxis_lock_set (bsc#1190317).\n- cifs: remove two cases where rc is set unnecessarily in sid_to_id (bsc#1190317).\n- cifs: remove unnecessary copies of tcon->crfid.fid (bsc#1190317).\n- cifs: remove various function description warnings (bsc#1190317).\n- cifs: rename the *_shroot* functions to *_cached_dir* (bsc#1190317).\n- cifs: retry lookup and readdir when EAGAIN is returned (bsc#1190317).\n- cifs: return cached_fid from open_shroot (bsc#1190317).\n- cifs: revalidate mapping when we open files for SMB1 POSIX (bsc#1190317).\n- cifs: set server->cipher_type to AES-128-CCM for SMB3.0 (bsc#1190317).\n- cifs: smb1: Try failing back to SetFileInfo if SetPathInfo fails (bsc#1190317).\n- cifs: store a pointer to the root dentry in cifs_sb_info once we have completed mounting the share (bsc#1190317).\n- cifs: update ctime and mtime during truncate (bsc#1190317).\n- cifs: update new ACE pointer after populate_new_aces (bsc#1190317).\n- cifs: use echo_interval even when connection not ready (bsc#1190317).\n- cifs: use the expiry output of dns_query to schedule next resolution (bsc#1190317).\n- crypto: qat - detect PFVF collision after ACK (git-fixes).\n- crypto: qat - disregard spurious PFVF interrupts (git-fixes).\n- crypto: s5p-sss - Add error handling in s5p_aes_probe() (git-fixes).\n- ext4: fix potential infinite loop in ext4_dx_readdir() (bsc#1191662).\n- ext4: fix reserved space counter leakage (bsc#1191450).\n- fs, mm: fix race in unlinking swapfile (bsc#1191455).\n- fs: copy BTRFS_IOC_[SG]ET_FSLABEL to vfs (bsc#1191500).\n- ftrace: Fix scripts/recordmcount.pl due to new binutils (bsc#1192267).\n- gianfar: Account for Tx PTP timestamp in the skb headroom (git-fixes).\n- gianfar: Fix TX timestamping with a stacked DSA driver (git-fixes).\n- gianfar: Replace skb_realloc_headroom with skb_cow_head for PTP (git-fixes).\n- gianfar: simplify FCS handling and fix memory leak (git-fixes).\n- icmpv6: Add ICMPv6 Parameter Problem, code 3 definition (bsc#1191241).\n- ipc: remove memcg accounting for sops objects in do_semtimedop()\n- ipv4: fix race condition between route lookup and invalidation (bsc#1190397).\n- ipv6/netfilter: Discard first fragment not including all headers (bsc#1191241).\n- ipv6: reply ICMP error if the first fragment do not include all headers (bsc#1191241).\n- kernel, fs: Introduce and use set_restart_fn() and arch_set_restart_data() (bsc#1191713).\n- kernel/locking/mutex.c: remove caller signal_pending branch predictions (bsc#1050549).\n- lib: iov_iter_fault_in_readable() should do nothing in xarray case (bsc#1191579).\n- locking/mutex: clear MUTEX_FLAGS if wait_list is empty due to signal (git-fixes).\n- locking/pvqspinlock/x86: Use LOCK_PREFIX in __pv_queued_spin_unlock() assembly code (bsc#1050549).\n- net: cdc_eem: fix tx fixup skb leak (git-fixes).\n- net: cdc_ncm: correct overhead in delayed_ndp_size (git-fixes).\n- net: cdc_ncm: use tasklet_init() for tasklet_struct init (git-fixes).\n- net: hso: add failure handler for add_net_device (git-fixes).\n- net: hso: fix NULL-deref on disconnect regression (git-fixes).\n- net: hso: fix null-ptr-deref during tty device unregistration (git-fixes).\n- net: hso: remove redundant unused variable dev (git-fixes).\n- net: ipv6: Discard next-hop MTU less than minimum link MTU (bsc#1191241).\n- net: mana: Fix error handling in mana_create_rxq() (git-fixes, bsc#1191801).\n- net: usb: Fix uninit-was-stored issue in asix_read_phy_addr() (git-fixes).\n- net: usb: qmi_wwan: added support for Thales Cinterion PLSx3 modem family (git-fixes).\n- net: usb: qmi_wwan: support ZTE P685M modem (git-fixes).\n- net_sched: cls_route: remove the right filter from hashtable (networking-stable-20_03_28).\n- netfilter: Drop fragmented ndisc packets assembled in netfilter (git-fixes).\n- ocfs2: Fix data corruption after conversion from inline format (bsc#1190795).\n- ocfs2: Fix data corruption on truncate (bsc#1190795).\n- ocfs2: do not zero pages beyond i_size (bsc#1190795).\n- ocfs2: drop acl cache for directories too (bsc#1191667).\n- powerpc/64s: Fix crashes when toggling entry flush barrier\n- powerpc/bpf: Fix BPF_MOD when imm == 1 (bsc#1065729).\n- powerpc/bpf: Fix BPF_SUB when imm == 0x80000000 (bsc#1065729).\n- powerpc/bpf: Use bctrl for making function calls (bsc#1065729).\n- powerpc/lib: Fix emulate_step() std test (bsc#1065729).\n- powerpc/pseries: Fix build error when NUMA=n (bsc#1190620 ltc#194498 git-fixes).\n- powerpc/xive: Discard disabled interrupts in get_irqchip_state() (bsc#1085030 git-fixes).\n- pseries/eeh: Fix the kdump kernel crash during eeh_pseries_init (git-fixes).\n- s390x: Turn off CONFIG_NUMA_EMU (jsc#SLE-11600).\n- scsi: lpfc: Allow PLOGI retry if previous PLOGI was aborted (bsc#1192145).\n- scsi: lpfc: Allow fabric node recovery if recovery is in progress before devloss (bsc#1192145).\n- scsi: lpfc: Correct sysfs reporting of loop support after SFP status change (bsc#1192145).\n- scsi: lpfc: Fix crash when nvmet transport calls host_release (bsc#1192145).\n- scsi: lpfc: Fix link down processing to address NULL pointer dereference (bsc#1192145).\n- scsi: lpfc: Fix memory overwrite during FC-GS I/O abort handling (bsc#1191349).\n- scsi: lpfc: Fix use-after-free in lpfc_unreg_rpi() routine (bsc#1192145).\n- scsi: lpfc: Revert LOG_TRACE_EVENT back to LOG_INIT prior to driver_resource_setup() (bsc#1192145).\n- scsi: lpfc: Update lpfc version to 14.0.0.3 (bsc#1192145).\n- scsi: lpfc: Wait for successful restart of SLI3 adapter during host sg_reset (bsc#1192145).\n- scsi: qla2xxx: Add debug print of 64G link speed (bsc#1190941).\n- scsi: qla2xxx: Add host attribute to trigger MPI hang (bsc#1190941).\n- scsi: qla2xxx: Add support for mailbox passthru (bsc#1190941).\n- scsi: qla2xxx: Adjust request/response queue size for 28xx (bsc#1190941).\n- scsi: qla2xxx: Call process_response_queue() in Tx path (bsc#1190941).\n- scsi: qla2xxx: Changes to support FCP2 Target (bsc#1190941).\n- scsi: qla2xxx: Changes to support kdump kernel (bsc#1190941).\n- scsi: qla2xxx: Changes to support kdump kernel for NVMe BFS (bsc#1190941).\n- scsi: qla2xxx: Check for firmware capability before creating QPair (bsc#1190941).\n- scsi: qla2xxx: Display 16G only as supported speeds for 3830c card (bsc#1190941).\n- scsi: qla2xxx: Do not call fc_block_scsi_eh() during bus reset (bsc#1190941).\n- scsi: qla2xxx: Fix NPIV create erroneous error (bsc#1190941).\n- scsi: qla2xxx: Fix NVMe retry (bsc#1190941).\n- scsi: qla2xxx: Fix NVMe session down detection (bsc#1190941).\n- scsi: qla2xxx: Fix NVMe | FCP personality change (bsc#1190941).\n- scsi: qla2xxx: Fix crash in NVMe abort path (bsc#1190941).\n- scsi: qla2xxx: Fix excessive messages during device logout (bsc#1190941).\n- scsi: qla2xxx: Fix hang during NVMe session tear down (bsc#1190941).\n- scsi: qla2xxx: Fix hang on NVMe command timeouts (bsc#1190941).\n- scsi: qla2xxx: Fix kernel crash when accessing port_speed sysfs file (bsc#1190941).\n- scsi: qla2xxx: Fix port type info (bsc#1190941).\n- scsi: qla2xxx: Fix unsafe removal from linked list (bsc#1190941).\n- scsi: qla2xxx: Fix use after free in eh_abort path (bsc#1190941).\n- scsi: qla2xxx: Move heartbeat handling from DPC thread to workqueue (bsc#1190941).\n- scsi: qla2xxx: Open-code qla2xxx_eh_device_reset() (bsc#1190941).\n- scsi: qla2xxx: Open-code qla2xxx_eh_target_reset() (bsc#1190941).\n- scsi: qla2xxx: Remove redundant initialization of pointer req (bsc#1190941).\n- scsi: qla2xxx: Restore initiator in dual mode (bsc#1190941).\n- scsi: qla2xxx: Show OS name and version in FDMI-1 (bsc#1190941).\n- scsi: qla2xxx: Suppress unnecessary log messages during login (bsc#1190941).\n- scsi: qla2xxx: Sync queue idx with queue_pair_map idx (bsc#1190941).\n- scsi: qla2xxx: Update version to 10.02.06.100-k (bsc#1190941).\n- scsi: qla2xxx: Update version to 10.02.06.200-k (bsc#1190941).\n- scsi: qla2xxx: Update version to 10.02.07.100-k (bsc#1190941).\n- scsi: qla2xxx: Use scsi_cmd_to_rq() instead of scsi_cmnd.request (bsc#1190941).\n- scsi: qla2xxx: edif: Add N2N support for EDIF (bsc#1190941).\n- scsi: qla2xxx: edif: Do secure PLOGI when auth app is present (bsc#1190941).\n- scsi: qla2xxx: edif: Fix EDIF enable flag (bsc#1190941).\n- scsi: qla2xxx: edif: Fix returnvar.cocci warnings (bsc#1190941).\n- scsi: qla2xxx: edif: Fix stale session (bsc#1190941).\n- scsi: qla2xxx: edif: Reject AUTH ELS on session down (bsc#1190941).\n- scsi: qla2xxx: edif: Use link event to wake up app (bsc#1190941).\n- scsi: smartpqi: Fix an error code in pqi_get_raid_map() (git-fixes).\n- sctp: fully initialize v4 addr in some functions (bsc#1188563).\n- selinux: fix error initialization in inode_doinit_with_dentry() (git-fixes).\n- selinux: fix inode_doinit_with_dentry() LABEL_INVALID error handling (git-fxes).\n- smb2: fix use-after-free in smb2_ioctl_query_info() (bsc#1190317).\n- smb3: Add debug message for new file creation with idsfromsid mount option (bsc#1190317).\n- smb3: Add new parm 'nodelete' (bsc#1190317).\n- smb3: Avoid Mid pending list corruption (bsc#1190317).\n- smb3: Call cifs reconnect from demultiplex thread (bsc#1190317).\n- smb3: Handle error case during offload read path (bsc#1190317).\n- smb3: add indatalen that can be a non-zero value to calculation of credit charge in smb2 ioctl (bsc#1190317).\n- smb3: add some missing definitions from MS-FSCC (bsc#1190317).\n- smb3: allow uid and gid owners to be set on create with idsfromsid mount option (bsc#1190317).\n- smb3: do not try to cache root directory if dir leases not supported (bsc#1190317).\n- smb3: fix access denied on change notify request to some servers (bsc#1190317).\n- smb3: fix cached file size problems in duplicate extents (reflink) (bsc#1190317).\n- smb3: fix incorrect number of credits when ioctl MaxOutputResponse > 64K (bsc#1190317).\n- smb3: fix possible access to uninitialized pointer to DACL (bsc#1190317).\n- smb3: fix stat when special device file and mounted with modefromsid (bsc#1190317).\n- smb3: fix unneeded error message on change notify (bsc#1190317).\n- smb3: limit noisy error (bsc#1190317).\n- smb3: minor update to compression header definitions (bsc#1190317).\n- smb3: prevent races updating CurrentMid (bsc#1190317).\n- smb3: rc uninitialized in one fallocate path (bsc#1190317).\n- smb3: remove static checker warning (bsc#1190317).\n- tcp/dccp: fix possible race __inet_lookup_established() (bsc#1180624).\n- tpm: ibmvtpm: Avoid error message when process gets signal while waiting (bsc#1065729).\n- uapi: nfnetlink_cthelper.h: fix userspace compilation error (git-fixes).\n- update structure definitions from updated protocol documentation (bsc#1190317).\n- usb-storage: Add quirk for ScanLogic SL11R-IDE older than 2.6c (git-fixes).\n- usb: hso: fix error handling code of hso_create_net_device (git-fixes).\n- usb: typec: tcpm: handle SRC_STARTUP state if cc changes (git-fixes).\n- usb: xhci-mtk: fix broken streams issue on 0.96 xHCI (git-fixes).\n- usb: xhci: dbc: Simplify error handling in 'xhci_dbc_alloc_requests()' (git-fixes).\n- usb: xhci: dbc: Use GFP_KERNEL instead of GFP_ATOMIC in 'xhci_dbc_alloc_requests()' (git-fixes).\n- x86/reboot: Limit Dell Optiplex 990 quirk to early BIOS versions (bsc#1114648).\n- x86/resctrl: Free the ctrlval arrays when domain_setup_mon_state() fails (bsc#1114648).\n- xen: fix setting of max_pfn in shared_info (git-fixes).\n- xen: reset legacy rtc flag for PV domU (git-fixes).\n- xfs: Fixed non-directory creation in SGID directories introduced by CVE-2018-13405 patch (bsc#1190006).\n- xfs: always honor OWN_UNKNOWN rmap removal requests (bsc#1191500).\n- xfs: convert growfs AG header init to use buffer lists (bsc#1191500).\n- xfs: factor ag btree root block initialisation (bsc#1191500).\n- xfs: factor out AG header initialisation from growfs core (bsc#1191500).\n- xfs: fix check on struct_version for versions 4 or greater (bsc#1191500, git-fixes).\n- xfs: fix string handling in label get/set functions (bsc#1191500, git-fixes).\n- xfs: hoist xfs_fs_geometry to libxfs (bsc#1191500).\n- xfs: implement online get/set fs label (bsc#1191500).\n- xfs: make imaxpct changes in growfs separate (bsc#1191500).\n- xfs: move growfs core to libxfs (bsc#1191500).\n- xfs: one-shot cached buffers (bsc#1191500).\n- xfs: refactor the geometry structure filling function (bsc#1191500).\n- xfs: rework secondary superblock updates in growfs (bsc#1191500).\n- xfs: separate secondary sb update in growfs (bsc#1191500).\n- xfs: turn ag header initialisation into a table driven operation (bsc#1191500).\n- xfs: xfs_fsops: drop useless LIST_HEAD (bsc#1191500, git-fixes).\n",
	"affected": [
		{
			"package": {
				"ecosystem": "SUSE:Linux Enterprise High Availability Extension 12 SP5",
				"name": "kernel-default",
				"purl": "pkg:rpm/suse/kernel-default&distro=SUSE%20Linux%20Enterprise%20High%20Availability%20Extension%2012%20SP5"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "4.12.14-122.98.1"
						}
					]
				}
			],
			"ecosystem_specific": {
				"binaries": [
					{
						"cluster-md-kmp-default": "4.12.14-122.98.1",
						"dlm-kmp-default": "4.12.14-122.98.1",
						"gfs2-kmp-default": "4.12.14-122.98.1",
						"ocfs2-kmp-default": "4.12.14-122.98.1"
					}
				]
			}
		},
		{
			"package": {
				"ecosystem": "SUSE:Linux Enterprise Live Patching 12 SP5",
				"name": "kernel-default",
				"purl": "pkg:rpm/suse/kernel-default&distro=SUSE%20Linux%20Enterprise%20Live%20Patching%2012%20SP5"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "4.12.14-122.98.1"
						}
					]
				}
			],
			"ecosystem_specific": {
				"binaries": [
					{
						"kernel-default-kgraft": "4.12.14-122.98.1",
						"kernel-default-kgraft-devel": "4.12.14-122.98.1",
						"kgraft-patch-4_12_14-122_98-default": "1-8.7.1"
					}
				]
			}
		},
		{
			"package": {
				"ecosystem": "SUSE:Linux Enterprise Live Patching 12 SP5",
				"name": "kgraft-patch-SLE12-SP5_Update_25",
				"purl": "pkg:rpm/suse/kgraft-patch-SLE12-SP5_Update_25&distro=SUSE%20Linux%20Enterprise%20Live%20Patching%2012%20SP5"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "1-8.7.1"
						}
					]
				}
			],
			"ecosystem_specific": {
				"binaries": [
					{
						"kernel-default-kgraft": "4.12.14-122.98.1",
						"kernel-default-kgraft-devel": "4.12.14-122.98.1",
						"kgraft-patch-4_12_14-122_98-default": "1-8.7.1"
					}
				]
			}
		},
		{
			"package": {
				"ecosystem": "SUSE:Linux Enterprise Software Development Kit 12 SP5",
				"name": "kernel-docs",
				"purl": "pkg:rpm/suse/kernel-docs&distro=SUSE%20Linux%20Enterprise%20Software%20Development%20Kit%2012%20SP5"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "4.12.14-122.98.1"
						}
					]
				}
			],
			"ecosystem_specific": {
				"binaries": [
					{
						"kernel-docs": "4.12.14-122.98.1",
						"kernel-obs-build": "4.12.14-122.98.1"
					}
				]
			}
		},
		{
			"package": {
				"ecosystem": "SUSE:Linux Enterprise Software Development Kit 12 SP5",
				"name": "kernel-obs-build",
				"purl": "pkg:rpm/suse/kernel-obs-build&distro=SUSE%20Linux%20Enterprise%20Software%20Development%20Kit%2012%20SP5"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "4.12.14-122.98.1"
						}
					]
				}
			],
			"ecosystem_specific": {
				"binaries": [
					{
						"kernel-docs": "4.12.14-122.98.1",
						"kernel-obs-build": "4.12.14-122.98.1"
					}
				]
			}
		},
		{
			"package": {
				"ecosystem": "SUSE:Linux Enterprise Server 12 SP5",
				"name": "kernel-default",
				"purl": "pkg:rpm/suse/kernel-default&distro=SUSE%20Linux%20Enterprise%20Server%2012%20SP5"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "4.12.14-122.98.1"
						}
					]
				}
			],
			"ecosystem_specific": {
				"binaries": [
					{
						"kernel-default": "4.12.14-122.98.1",
						"kernel-default-base": "4.12.14-122.98.1",
						"kernel-default-devel": "4.12.14-122.98.1",
						"kernel-default-man": "4.12.14-122.98.1",
						"kernel-devel": "4.12.14-122.98.1",
						"kernel-macros": "4.12.14-122.98.1",
						"kernel-source": "4.12.14-122.98.1",
						"kernel-syms": "4.12.14-122.98.1"
					}
				]
			}
		},
		{
			"package": {
				"ecosystem": "SUSE:Linux Enterprise Server 12 SP5",
				"name": "kernel-source",
				"purl": "pkg:rpm/suse/kernel-source&distro=SUSE%20Linux%20Enterprise%20Server%2012%20SP5"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "4.12.14-122.98.1"
						}
					]
				}
			],
			"ecosystem_specific": {
				"binaries": [
					{
						"kernel-default": "4.12.14-122.98.1",
						"kernel-default-base": "4.12.14-122.98.1",
						"kernel-default-devel": "4.12.14-122.98.1",
						"kernel-default-man": "4.12.14-122.98.1",
						"kernel-devel": "4.12.14-122.98.1",
						"kernel-macros": "4.12.14-122.98.1",
						"kernel-source": "4.12.14-122.98.1",
						"kernel-syms": "4.12.14-122.98.1"
					}
				]
			}
		},
		{
			"package": {
				"ecosystem": "SUSE:Linux Enterprise Server 12 SP5",
				"name": "kernel-syms",
				"purl": "pkg:rpm/suse/kernel-syms&distro=SUSE%20Linux%20Enterprise%20Server%2012%20SP5"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "4.12.14-122.98.1"
						}
					]
				}
			],
			"ecosystem_specific": {
				"binaries": [
					{
						"kernel-default": "4.12.14-122.98.1",
						"kernel-default-base": "4.12.14-122.98.1",
						"kernel-default-devel": "4.12.14-122.98.1",
						"kernel-default-man": "4.12.14-122.98.1",
						"kernel-devel": "4.12.14-122.98.1",
						"kernel-macros": "4.12.14-122.98.1",
						"kernel-source": "4.12.14-122.98.1",
						"kernel-syms": "4.12.14-122.98.1"
					}
				]
			}
		},
		{
			"package": {
				"ecosystem": "SUSE:Linux Enterprise Server for SAP Applications 12 SP5",
				"name": "kernel-default",
				"purl": "pkg:rpm/suse/kernel-default&distro=SUSE%20Linux%20Enterprise%20Server%20for%20SAP%20Applications%2012%20SP5"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "4.12.14-122.98.1"
						}
					]
				}
			],
			"ecosystem_specific": {
				"binaries": [
					{
						"kernel-default": "4.12.14-122.98.1",
						"kernel-default-base": "4.12.14-122.98.1",
						"kernel-default-devel": "4.12.14-122.98.1",
						"kernel-default-man": "4.12.14-122.98.1",
						"kernel-devel": "4.12.14-122.98.1",
						"kernel-macros": "4.12.14-122.98.1",
						"kernel-source": "4.12.14-122.98.1",
						"kernel-syms": "4.12.14-122.98.1"
					}
				]
			}
		},
		{
			"package": {
				"ecosystem": "SUSE:Linux Enterprise Server for SAP Applications 12 SP5",
				"name": "kernel-source",
				"purl": "pkg:rpm/suse/kernel-source&distro=SUSE%20Linux%20Enterprise%20Server%20for%20SAP%20Applications%2012%20SP5"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "4.12.14-122.98.1"
						}
					]
				}
			],
			"ecosystem_specific": {
				"binaries": [
					{
						"kernel-default": "4.12.14-122.98.1",
						"kernel-default-base": "4.12.14-122.98.1",
						"kernel-default-devel": "4.12.14-122.98.1",
						"kernel-default-man": "4.12.14-122.98.1",
						"kernel-devel": "4.12.14-122.98.1",
						"kernel-macros": "4.12.14-122.98.1",
						"kernel-source": "4.12.14-122.98.1",
						"kernel-syms": "4.12.14-122.98.1"
					}
				]
			}
		},
		{
			"package": {
				"ecosystem": "SUSE:Linux Enterprise Server for SAP Applications 12 SP5",
				"name": "kernel-syms",
				"purl": "pkg:rpm/suse/kernel-syms&distro=SUSE%20Linux%20Enterprise%20Server%20for%20SAP%20Applications%2012%20SP5"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "4.12.14-122.98.1"
						}
					]
				}
			],
			"ecosystem_specific": {
				"binaries": [
					{
						"kernel-default": "4.12.14-122.98.1",
						"kernel-default-base": "4.12.14-122.98.1",
						"kernel-default-devel": "4.12.14-122.98.1",
						"kernel-default-man": "4.12.14-122.98.1",
						"kernel-devel": "4.12.14-122.98.1",
						"kernel-macros": "4.12.14-122.98.1",
						"kernel-source": "4.12.14-122.98.1",
						"kernel-syms": "4.12.14-122.98.1"
					}
				]
			}
		},
		{
			"package": {
				"ecosystem": "SUSE:Linux Enterprise Workstation Extension 12 SP5",
				"name": "kernel-default",
				"purl": "pkg:rpm/suse/kernel-default&distro=SUSE%20Linux%20Enterprise%20Workstation%20Extension%2012%20SP5"
			},
			"ranges": [
				{
					"type": "ECOSYSTEM",
					"events": [
						{
							"introduced": "0"
						},
						{
							"fixed": "4.12.14-122.98.1"
						}
					]
				}
			],
			"ecosystem_specific": {
				"binaries": [
					{
						"kernel-default-extra": "4.12.14-122.98.1"
					}
				]
			}
		}
	],
	"references": [
		{
			"type": "ADVISORY",
			"url": "https://www.suse.com/support/update/announcement/2021/suse-su-20213748-1/"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1050549"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1065729"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1085030"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1114648"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1180624"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1184673"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1186063"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1186109"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1188563"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1188601"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1188983"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1188985"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1190006"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1190067"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1190317"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1190349"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1190397"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1190479"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1190620"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1190795"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1190941"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1191241"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1191315"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1191317"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1191349"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1191450"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1191452"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1191455"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1191500"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1191579"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1191628"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1191662"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1191667"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1191713"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1191801"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1191888"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1192145"
		},
		{
			"type": "REPORT",
			"url": "https://bugzilla.suse.com/1192267"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2018-13405"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2021-33033"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2021-34556"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2021-3542"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2021-35477"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2021-3655"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2021-3715"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2021-37159"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2021-3760"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2021-41864"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2021-42008"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2021-42252"
		},
		{
			"type": "WEB",
			"url": "https://www.suse.com/security/cve/CVE-2021-42739"
		}
	]
}
